{
  "backend/main.mo": "Motoko canister defining core domain models (profiles, training sessions, techniques, belts, analytics) and storing per-user data with access control, blob storage integration, and authorization mixins for a BJJ training log application.",
  "feature_evidence.json": "Feature evidence report documenting a frontend UX update to the four belt-specific submission dropdown controls, including affected file, dependencies, test IDs, and confidence level.",
  "frontend-file-summaries.txt": "Prewritten summaries of key frontend React components, hooks, utilities, and pages describing their responsibilities and recent architectural or UX changes.",
  "frontend/index.css": "Global Tailwind CSS configuration defining design tokens, light/dark theme variables, chart colors, sidebar styling, and base element styles.",
  "frontend/index.html": "Minimal HTML entry point that sets up the root container and loads the React application module.",
  "frontend/src/App.tsx": "Root React component handling authentication, backend actor initialization, theme bootstrapping, and conditional routing between login, profile setup, and the main dashboard.",
  "frontend/src/components/AddTechniqueDialog.tsx": "Dialog component for creating techniques with category selection, searchable/creatable type input, tag management, and automatic YouTube thumbnail generation from links.",
  "frontend/src/components/AddTrainingDialog.tsx": "Modal dialog for adding or editing a BJJ training session, managing date, duration, type, theme, rolls, and mood, and persisting via query mutations.",
  "frontend/src/components/Analytics.tsx": "Empty component file; analytics UI or logic has not yet been implemented.",
  "frontend/src/components/BeltTracker.tsx": "Displays and updates the user's BJJ belt and stripe progression with visual states, belt images, and backend synchronization.",
  "frontend/src/components/DebugOverlay.tsx": "Toggleable debug panel showing authentication, actor initialization status, progress, warnings, and detailed logs for troubleshooting.",
  "frontend/src/components/Footer.tsx": "Simple footer displaying copyright text and a link attribution with an icon.",
  "frontend/src/components/Header.tsx": "Application header with branding, profile access, logout, theme toggle, and debug mode toggle, integrated with authentication and user preferences.",
  "frontend/src/components/LoginScreen.tsx": "Full-screen login page for Internet Identity authentication with branding, loading states, and feature highlights.",
  "frontend/src/components/Profile.tsx": "Empty component file reserved for a user profile view or editor.",
  "frontend/src/components/ProfileAnalytics.tsx": "Displays user profile analytics including profile info, belt details, training stats, streak calculation, and a training heatmap using fetched profile and session data.",
  "frontend/src/components/ProfileSetup.tsx": "Provides a form for creating or editing a user profile, handling username, belt progress, gym info, profile picture upload, and practitioner start date with save and cancel flows.",
  "frontend/src/components/SubmissionLogSection.tsx": "Manages a per-belt submission log, allowing users to add, remove, normalize, and save submission counts while tracking unsaved changes.",
  "frontend/src/components/SubmissionSelectInput.tsx": "Implements a searchable, keyboard-navigable popover input for adding submissions from a predefined list while preventing duplicates.",
  "frontend/src/components/SubmissionTagInput.tsx": "Empty or unimplemented component file reserved for future submission tag input functionality.",
  "frontend/src/components/TechniqueLibrary.tsx": "Renders a searchable and filterable personal technique library with category tabs and an add-technique dialog backed by fetched technique data.",
  "frontend/src/components/TrainingHeatMap.tsx": "Renders a yearly GitHub-style heatmap of training hours per day, aggregating session durations by local date and supporting year navigation, date selection, and theme-aware color recalculation.",
  "frontend/src/components/TrainingHoursHeatMap.tsx": "Displays and edits a weekly-based yearly heatmap of training hours with strict ISO weekday alignment, including controls to add, modify, save, and clear per-day training hours.",
  "frontend/src/components/TrainingLog.tsx": "Provides a full training session log with add/edit/delete functionality, expandable session details, and analytics visualizations (charts) summarizing themes, moods, and recent activity.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and caches a backend actor based on the current Internet Identity, initializes access control with an optional admin token, and invalidates dependent queries on change.",
  "frontend/src/hooks/useActorReady.ts": "Empty placeholder file with no implementation.",
  "frontend/src/hooks/useActorWrapper.ts": "Enhanced actor initialization hook that wraps actor creation with step-by-step state tracking and logging for debugging authentication, identity retrieval, and actor setup.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity authentication context, handling login, logout, persisted identities, and exposing detailed login status flags via a React context provider.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating backend data such as user profiles, registration, and training-related records, using an actor wrapper and providing toast-based success/error feedback.",
  "frontend/src/index.css": "Global Tailwind CSS setup defining design tokens, light/dark theme variables, BJJ-specific colors, utility classes, and custom styling for heat map scrollbars and layout.",
  "frontend/src/lib/beltUtils.ts": "Utility functions for working with belt levels, including generating belt image URLs, preloading belt images for caching, and formatting belt display names.",
  "frontend/src/lib/formatters.ts": "Provides a formatter to convert backend SessionTheme enum values into user-friendly, readable labels for display.",
  "frontend/src/lib/submissionLogUtils.ts": "Helper functions to normalize, add, remove, merge, and update submission counts in a case-insensitive way for submission logging features.",
  "frontend/src/lib/submissionOptions.ts": "Exports a constant, typed list of predefined Brazilian Jiu-Jitsu submission techniques used as dropdown options across the app.",
  "frontend/src/lib/utils.ts": "General utilities including class name merging, local-date formatting/parsing, ISO weekday calculation, heat map color logic, and generation of a yearly heat map grid using consistent local-time rules.",
  "frontend/src/main.tsx": "Frontend entry point that creates the React root and wraps the app with React Query and Internet Identity providers before rendering App.",
  "frontend/src/pages/Dashboard.tsx": "Implements the main dashboard page with tabbed navigation between profile analytics, training log, belt tracker, and technique library components.",
  "frontend/src/utils/urlParams.ts": "Provides helper functions to read URL parameters from query strings or hash-based routes, persist them in sessionStorage, and retrieve or clear them with URL values taking precedence.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining content paths, dark mode strategy, container settings, extended color palette via CSS variables, custom radii, shadows, animations, and enabled plugins.",
  "project_state.json": "Machine-readable snapshot of the project’s current state, including schema/versioning info, a high-level app summary, and a catalog of implemented features with IDs, descriptions, and versions."
}