{
  "backend/main.mo": "Defines Motoko actor types for training sessions, belt progress, user profiles, techniques, goals, and analytics structures; core backend data model with no functions shown.",
  "feature_evidence.json": "Feature evidence report listing feature IDs, descriptions, related files, components, and test references for analytics updates.",
  "frontend-file-summaries.txt": "Prewritten summaries of all frontend source files describing their purpose, features, and UI behavior.",
  "frontend/index.css": "Sets up Tailwind layers and defines light/dark theme CSS variables for UI colors and layout.",
  "frontend/index.html": "Basic HTML entry point mounting the React root and loading main.tsx.",
  "frontend/REBUILD_DEPLOY_DRAFT_105.md": "Documentation for clean rebuild and redeploy of Draft 105 with no functional changes, including validation steps and rebuild procedure.",
  "frontend/REBUILD_DEPLOY_DRAFT_110.md": "Documentation for clean rebuild and redeploy of Draft 110 outlining checks and deployment commands without code changes.",
  "frontend/REBUILD_DEPLOY_DRAFT_115.md": "Clean rebuild and redeploy checklist for Draft 115 confirming no code or schema changes and listing deployment steps.",
  "frontend/REBUILD_DEPLOY_DRAFT_94.md": "Rebuild and redeploy checklist for Draft 94 detailing prerequisites and build steps with no functional modifications.",
  "frontend/REDEPLOY_NOTE_DRAFT_105.md": "Template-style redeploy note for Draft 105 capturing deployment steps, status, and placeholders for IDs and notes.",
  "frontend/REDEPLOY_NOTE_DRAFT_110.md": "Redeploy note for Draft 110 including deployment steps, status options, and fields for error reporting.",
  "frontend/REDEPLOY_NOTE_DRAFT_115.md": "Draft 115 redeploy note template documenting deployment info, steps executed, and any failing steps.",
  "frontend/REDEPLOY_NOTE_TEMPLATE.md": "Generic redeploy note template with sections for deployment scope, failure location, and error output.",
  "frontend/SMOKE_CHECK_DRAFT_105.md": "Post-deployment smoke check for Draft 105 covering login screen rendering and basic load validation.",
  "frontend/SMOKE_CHECK_DRAFT_110.md": "Smoke check template for Draft 110 verifying initial load, login screen, and console errors.",
  "frontend/SMOKE_CHECK_DRAFT_115.md": "Smoke check for Draft 115 confirming application loads correctly and Internet Identity login appears without errors.",
  "frontend/src/App.tsx": "Main app component controlling auth flow, backend actor readiness, profile loading, and rendering screens accordingly.",
  "frontend/src/components/AddTechniqueDialog.tsx": "Dialog for creating a technique with fields, YouTube thumbnail generation, tags, and category selection.",
  "frontend/src/components/AddTrainingDialog.tsx": "Dialog for adding or editing training sessions with date, duration, theme, mood, intensity, and roll tracking.",
  "frontend/src/components/Analytics.tsx": "Empty placeholder component.",
  "frontend/src/components/BeltTracker.tsx": "Displays and updates belt progress using profile, training, and submission data with gamified stats.",
  "frontend/src/components/CachedImage.tsx": "Image component that preloads images with fallback support and loading state styling.",
  "frontend/src/components/DebugOverlay.tsx": "Debug overlay component showing actor initialization state, logs, and warnings with a toggleable panel UI.",
  "frontend/src/components/Footer.tsx": "Simple footer displaying copyright info and a link to caffeine.ai.",
  "frontend/src/components/Header.tsx": "App header with branding, profile access, theme toggle, debug mode toggle, and logout handling.",
  "frontend/src/components/LoginScreen.tsx": "Login screen that initiates Internet Identity authentication with a styled welcome and feature preview.",
  "frontend/src/components/Profile.tsx": "Empty placeholder component file with no implemented content.",
  "frontend/src/components/ProfileAnalytics.tsx": "Profile analytics view computing training stats, submissions, streaks, and rendering profile and activity insights.",
  "frontend/src/components/ProfileSetup.tsx": "Profile creation/edit form allowing users to set personal details, belt rank, gym info, and profile picture.",
  "frontend/src/components/SubmissionLogSection.tsx": "Manages a user's submission log by belt level, syncing with backend data, detecting unsaved changes, and providing UI controls to add, remove, and save submissions.",
  "frontend/src/components/SubmissionSelectInput.tsx": "Provides a searchable popover input for selecting submissions, filtering out selected ones, and adding new selections via keyboard or click.",
  "frontend/src/components/SubmissionTagInput.tsx": "Empty file with no implementation.",
  "frontend/src/components/TechniqueLibrary.tsx": "Displays a searchable and filterable list of techniques by category, with an option to add new techniques.",
  "frontend/src/components/TrainingHeatMap.tsx": "Renders a yearly training heatmap by mapping session durations to daily cells with dynamic theme support.",
  "frontend/src/components/TrainingHoursHeatMap.tsx": "Generates a weekly ISO‑aligned heatmap grid for training hours and provides UI to edit, save, and clear recorded hours.",
  "frontend/src/components/TrainingLog.tsx": "Main training log UI that loads sessions, computes analytics, and renders charts, stats, and dialogs for adding or editing sessions.",
  "frontend/src/components/TrainingMonthCalendar.tsx": "Monthly calendar view that groups sessions by date, displays training indicators, and supports month navigation and session editing.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor tied to the user's identity, invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useActorReady.ts": "Empty placeholder file with no implementation.",
  "frontend/src/hooks/useActorWrapper.ts": "Enhanced actor initialization hook with step tracking, logging, and identity-based actor creation with optional admin token setup.",
  "frontend/src/hooks/useDragToScroll.ts": "Hook enabling drag-to-scroll behavior on an element using pointer events.",
  "frontend/src/hooks/useInternetIdentity.ts": "Internet Identity provider and hook managing authentication lifecycle, identity loading, login, and logout behaviors.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for loading and mutating user profile, registration, and training data via an actor wrapper with caching and error handling.",
  "frontend/src/index.css": "Tailwind base and utility layers defining theme variables, BJJ color utilities, dark mode overrides, and heat‑map scrollbar styles.",
  "frontend/src/lib/beltStatsCalculator.ts": "Computes belt progression, experience, submission proficiency, and technique mastery stats from training sessions and submission logs.",
  "frontend/src/lib/beltUtils.ts": "Provides helpers to get belt image URLs, belt names, and preload all belt‑related image assets.",
  "frontend/src/lib/formatters.ts": "Maps session theme enum values to human‑readable labels.",
  "frontend/src/lib/imageCache.ts": "Simple in‑memory image preload cache to avoid flicker and allow clearing cached entries.",
  "frontend/src/lib/intensityUtils.ts": "Defines intensity options and helpers for labels, short codes, colors, and numeric conversions.",
  "frontend/src/lib/moodIcons.ts": "Maps mood ratings to generated mood icon assets and labels, with helpers to fetch all icons.",
  "frontend/src/lib/submissionLogUtils.ts": "Utility functions to normalize, find, add, remove, increment, decrement, and merge submission entries in a submission log.",
  "frontend/src/lib/submissionOptions.ts": "Exports a constant array of all BJJ submission names and a corresponding union type.",
  "frontend/src/lib/submissionsListLoader.ts": "Empty file with no implementation.",
  "frontend/src/lib/trainingAnalytics.ts": "Provides functions for analyzing training data, including theme frequency, intensity averages, submission counts, and time‑bucketed roll statistics.",
  "frontend/src/lib/utils.ts": "Utility helpers for class merging, date formatting, ISO weekday handling, heatmap coloring, and generating year heatmap grids.",
  "frontend/src/main.tsx": "Initializes React app, sets up query client and Internet Identity provider, and renders the root component.",
  "frontend/src/pages/Dashboard.tsx": "Implements the main dashboard UI with tab navigation for analytics, training logs, belts, and techniques.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, persisting, and clearing URL parameters using query strings, hash routing, and sessionStorage.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining theme extensions, colors, animations, and plugins.",
  "project_state.json": "Defines the project’s schema version, a high-level description of the ICP Jiu-Jitsu Journey app, and a list of existing features including authentication, actor initialization, secret-token handling, RBAC, React Query hooks, and user-profile APIs."
}