{
  "backend/main.mo": "Defines Motoko actor data types for training sessions, belt progress, user profiles, techniques, goals, and system status.",
  "feature_evidence.json": "Contains feature evidence reports detailing required UI changes and associated frontend files for two features.",
  "frontend-file-summaries.txt": "Lists concise summaries of key frontend components, hooks, and utilities.",
  "frontend/index.css": "Defines Tailwind layers and extensive CSS variables for light and dark themes, applying global background, text, and border styles.",
  "frontend/index.html": "Basic HTML shell that loads the React app into the root div and imports main.tsx.",
  "frontend/REBUILD_DEPLOY_DRAFT_105.md": "Documentation for clean rebuild and redeploy of Draft 105 with no code changes.",
  "frontend/REBUILD_DEPLOY_DRAFT_110.md": "Instructions for performing a clean rebuild and redeploy of Draft 110 without modifying application code.",
  "frontend/REBUILD_DEPLOY_DRAFT_115.md": "Records clean rebuild and redeploy steps for Draft 115 with no functional or UI changes.",
  "frontend/REBUILD_DEPLOY_DRAFT_125.md": "Describes clean rebuild and redeploy process for Draft 125 with unchanged codebase.",
  "frontend/REBUILD_DEPLOY_DRAFT_94.md": "Rebuild and redeploy checklist for Draft 94 ensuring no functional or UI changes.",
  "frontend/REDEPLOY_NOTE_DRAFT_105.md": "Template-based redeploy note for Draft 105 covering steps, status, and canister info.",
  "frontend/REDEPLOY_NOTE_DRAFT_110.md": "Redeploy summary template for Draft 110 including steps, status, and error sections.",
  "frontend/REDEPLOY_NOTE_DRAFT_115.md": "Template redeploy note for Draft 115 capturing metadata, steps, and errors.",
  "frontend/REDEPLOY_NOTE_DRAFT_125.md": "Redeploy documentation for Draft 125 with fields for steps, outputs, and results.",
  "frontend/REDEPLOY_NOTE_TEMPLATE.md": "Generic redeploy note template for documenting deployment targets and failures.",
  "frontend/SMOKE_CHECK_DRAFT_105.md": "Smoke‑test checklist for verifying Draft 105 after deployment.",
  "frontend/SMOKE_CHECK_DRAFT_110.md": "Smoke‑check guide for Draft 110 validating initial load and core behavior.",
  "frontend/SMOKE_CHECK_DRAFT_115.md": "Smoke‑test checklist for Draft 115 covering load and login verification.",
  "frontend/SMOKE_CHECK_DRAFT_125.md": "Smoke‑test checklist for Draft 125 confirming basic post‑deployment functionality.",
  "frontend/src/App.tsx": "Main app component managing authentication, backend actor readiness, profile loading, theming, and routing between login, profile setup, and dashboard.",
  "frontend/src/components/AddTechniqueDialog.tsx": "Modal form for adding a technique with fields, category selection, tags, and auto-generated YouTube thumbnails.",
  "frontend/src/components/AddTrainingDialog.tsx": "Modal for adding or editing training sessions, handling date navigation, duration, theme, mood, intensity, and saving records.",
  "frontend/src/components/Analytics.tsx": "Empty component placeholder for analytics functionality.",
  "frontend/src/components/BeltTracker.tsx": "Displays and updates belt progress, computing gamified stats from training and submission logs with belt image handling.",
  "frontend/src/components/CachedImage.tsx": "Image component that preloads and caches images with fallback and loading state handling.",
  "frontend/src/components/DebugOverlay.tsx": "Empty component placeholder for debug overlay functionality.",
  "frontend/src/components/Footer.tsx": "Footer displaying attribution with a link and decorative heart icon.",
  "frontend/src/components/Header.tsx": "Navigation header that shows branding, profile access, theme toggle, and logout, handling identity and theme state updates.",
  "frontend/src/components/LoginScreen.tsx": "Full‑screen login UI using Internet Identity with loading state and introductory feature highlights.",
  "frontend/src/components/Profile.tsx": "Empty placeholder component; no implementation provided.",
  "frontend/src/components/ProfileAnalytics.tsx": "Displays user analytics including sessions, streaks, submissions, belt data, and cached images after loading profile and training logs.",
  "frontend/src/components/ProfileSetup.tsx": "Profile creation/edit form handling username, belt, gym info, dates, and profile picture upload with backend save flows.",
  "frontend/src/components/SubmissionLogSection.tsx": "Manages submission log editing by belt level with merge, add/remove, unsaved‑changes detection, and backend save.",
  "frontend/src/components/SubmissionSelectInput.tsx": "Searchable popover to add a submission from preset options, filtering out already‑selected items and supporting keyboard navigation.",
  "frontend/src/components/SubmissionTagInput.tsx": "Empty placeholder component; no implementation provided.",
  "frontend/src/components/TechniqueLibrary.tsx": "Displays a filterable, searchable list of techniques with category tabs and an add-technique dialog.",
  "frontend/src/components/TrainingHeatMap.tsx": "Renders a yearly heat map of training hours with local-time date mapping and dynamic theme updates.",
  "frontend/src/components/TrainingHoursHeatMap.tsx": "Provides an editable yearly heat map for training hours using ISO weekday grid logic and CRUD hooks.",
  "frontend/src/components/TrainingLog.tsx": "Shows training session analytics, charts, and logs with add/edit support.",
  "frontend/src/components/TrainingMonthCalendar.tsx": "Displays a monthly calendar of sessions with per-day styling and editing hooks.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous backend actor and invalidates queries on identity change.",
  "frontend/src/hooks/useActorReady.ts": "Empty file.",
  "frontend/src/hooks/useActorWrapper.ts": "Initializes an authenticated or anonymous backend actor with detailed step-by-step logging and exposes readiness state. Tracks authentication, identity retrieval, actor creation, and admin-token bootstrapping.",
  "frontend/src/hooks/useDragToScroll.ts": "Provides a ref enabling drag-to-scroll behavior for any scrollable element using pointer events. Manages drag state and updates scroll positions accordingly.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements a React context for Internet Identity authentication using AuthClient, exposing identity, login/logout, and login status. Restores stored identities and manages login flow state.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating user profile, registration, and training-related data through the actor wrapper. Ensures actor readiness and handles errors with notifications.",
  "frontend/src/index.css": "Global Tailwind CSS setup defining theme variables, dark mode palettes, BJJ-specific colors, scrollbar styles, and heat-map utility classes.",
  "frontend/src/lib/beltStatsCalculator.ts": "Calculates gamified belt progression stats based on training sessions and submission logs, including progression, experience, submissions, and technique mastery percentages.",
  "frontend/src/lib/beltUtils.ts": "Utility functions for belt image URL generation, friendly name formatting, and preloading belt images for all belt levels and stripe counts.",
  "frontend/src/lib/formatters.ts": "Maps session theme enums to human-readable labels with a fallback.",
  "frontend/src/lib/imageCache.ts": "Provides an in-memory image preloading cache to avoid flashing and a function to clear it.",
  "frontend/src/lib/intensityUtils.ts": "Defines intensity options and utilities for labels, colors, short codes, and numeric conversions.",
  "frontend/src/lib/moodIcons.ts": "Maps mood ratings to icon assets and labels, with helpers for getting single or all mood icons.",
  "frontend/src/lib/submissionLogUtils.ts": "Utility functions for managing submission logs including normalization, lookup, add/remove, count changes, and duplicate merging.",
  "frontend/src/lib/submissionOptions.ts": "Exports a comprehensive alphabetized list of BJJ submission technique names.",
  "frontend/src/lib/submissionsListLoader.ts": "Empty placeholder file with no implemented logic.",
  "frontend/src/lib/trainingAnalytics.ts": "Provides analytics helpers for sessions including favorite themes, average intensity, unique submissions, time bucketing, and roll averages.",
  "frontend/src/lib/utils.ts": "Includes class merging, date formatting/parsing, weekday utilities, heatmap color logic, and year grid generation.",
  "frontend/src/main.tsx": "Application entry point that initializes React, query client, identity provider, and renders the main app.",
  "frontend/src/pages/Dashboard.tsx": "Renders tabbed dashboard UI with sections for analytics, training log, belt tracking, and technique library.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read URL parameters (including hash-based), persist them in sessionStorage, and optionally remove sensitive params from the URL.",
  "frontend/tailwind.config.js": "Tailwind configuration defining dark mode, content paths, color tokens, animations, and plugins like typography and container queries.",
  "project_state.json": "Stores the project’s structured state, including versioning, a high-level dapp summary, and a list of existing feature definitions with metadata."
}