{
  "backend/main.mo": "Defines the Motoko actor with data types for training sessions, belts, profiles, goals, achievements, techniques, and system stats.",
  "feature_evidence.json": "Lists feature evidence records linking implemented UI gradient effects and component updates to specific files, components, and test IDs.",
  "frontend-file-summaries.txt": "Contains a JSON-style mapping of frontend file paths to brief functional summaries of each component or utility.",
  "frontend/DRAFT_127_REDEPLOY_ASSERTION.md": "Documents a quick redeploy for Draft 127 with no code, UI, or schema changes and includes verification steps.",
  "frontend/DRAFT_128_REDEPLOY_ASSERTION.md": "Outlines Draft 128 redeploy requirements confirming zero code changes and providing a checklist for verification.",
  "frontend/index.css": "Tailwind-based global stylesheet defining light/dark theme CSS variables and base styling.",
  "frontend/index.html": "HTML entry point mounting the React app and loading main.tsx.",
  "frontend/REBUILD_DEPLOY_DRAFT_105.md": "Describes clean rebuild and redeploy steps for Draft 105 with no functional or UI changes.",
  "frontend/REBUILD_DEPLOY_DRAFT_110.md": "Records the clean rebuild and redeploy procedure for Draft 110 with pre-deployment checks and commands.",
  "frontend/REBUILD_DEPLOY_DRAFT_115.md": "Tracks rebuild and redeploy steps for Draft 115, confirming no code or schema changes.",
  "frontend/REBUILD_DEPLOY_DRAFT_125.md": "Documents Draft 125 clean rebuild and redeploy with verification and environment checks.",
  "frontend/REBUILD_DEPLOY_DRAFT_127.md": "Outlines clean rebuild and redeploy steps for Draft 127 with no modifications allowed.",
  "frontend/REBUILD_DEPLOY_DRAFT_128.md": "Describes Draft 128 rebuild and redeploy with checklist ensuring no source changes.",
  "frontend/REBUILD_DEPLOY_DRAFT_94.md": "Provides rebuild and redeploy checklist for Draft 94, confirming no code or UI modifications.",
  "frontend/REDEPLOY_NOTE_DRAFT_105.md": "Template documenting redeploy steps, status, and verification for Draft 105.",
  "frontend/REDEPLOY_NOTE_DRAFT_110.md": "Redeploy note template for Draft 110 covering deployment steps, status, and error capture.",
  "frontend/REDEPLOY_NOTE_DRAFT_115.md": "Template for recording redeploy information, status checks, and errors for Draft 115.",
  "frontend/REDEPLOY_NOTE_DRAFT_125.md": "Template-style draft documenting deployment metadata, steps executed, and outcome for Draft 125.",
  "frontend/REDEPLOY_NOTE_DRAFT_127.md": "Draft 127 redeploy note describing context, potential failing steps, and error location placeholders.",
  "frontend/REDEPLOY_NOTE_DRAFT_128.md": "Draft 128 redeploy note outlining deployment context, steps, and error detail placeholders.",
  "frontend/REDEPLOY_NOTE_TEMPLATE.md": "General template for recording redeploy attempt metadata, target components, and failure details.",
  "frontend/SMOKE_CHECK_DRAFT_105.md": "Smoke test checklist for Draft 105 focused on verifying login screen rendering and errors.",
  "frontend/SMOKE_CHECK_DRAFT_110.md": "Smoke check for Draft 110 with initial load checks and canister metadata fields.",
  "frontend/SMOKE_CHECK_DRAFT_115.md": "Smoke test for Draft 115 verifying initial load and Internet Identity visibility.",
  "frontend/SMOKE_CHECK_DRAFT_125.md": "Draft 125 smoke check confirming app load behavior and noting console errors.",
  "frontend/SMOKE_CHECK_DRAFT_127.md": "Comprehensive smoke test for Draft 127 covering load, authentication, actor init, dashboard, and profile gating.",
  "frontend/SMOKE_CHECK_DRAFT_128.md": "Smoke test for Draft 128 verifying initial load, branding, login button, and console status.",
  "frontend/src/App.tsx": "Main React app controlling authentication flow, actor initialization, profile setup, and dashboard rendering.",
  "frontend/src/components/AddTechniqueDialog.tsx": "Dialog component for adding a technique with fields, YouTube thumbnail detection, tag handling, and form submission.",
  "frontend/src/components/AddTrainingDialog.tsx": "Dialog for creating or editing training sessions with date, duration, theme, mood, and intensity controls.",
  "frontend/src/components/Analytics.tsx": "Empty placeholder file for analytics component.",
  "frontend/src/components/BeltTracker.tsx": "Handles belt progress display and updates, computes gamified stats, and allows users to change belt and stripe levels.",
  "frontend/src/components/CachedImage.tsx": "Preloads an image with fallback handling and displays it with a loading fade effect.",
  "frontend/src/components/DebugOverlay.tsx": "Empty component file.",
  "frontend/src/components/Footer.tsx": "Renders the site footer with a credit message and link to caffeine.ai.",
  "frontend/src/components/Header.tsx": "Displays the top navigation bar with profile access, theme toggle, and logout functionality.",
  "frontend/src/components/LoginScreen.tsx": "Provides the login UI using Internet Identity with branded visuals and onboarding features.",
  "frontend/src/components/Profile.tsx": "Empty component file.",
  "frontend/src/components/ProfileAnalytics.tsx": "Shows detailed training analytics including sessions, submissions, streaks, and belt info with visual components.",
  "frontend/src/components/ProfileSetup.tsx": "Handles user onboarding or profile editing, including username, belt, gym info, and profile picture setup.",
  "frontend/src/components/SubmissionLogSection.tsx": "Displays and edits a user’s submission log by belt level, syncing local state with backend and detecting unsaved changes.",
  "frontend/src/components/SubmissionSelectInput.tsx": "Provides a searchable popover for adding submissions while filtering out already selected ones.",
  "frontend/src/components/SubmissionTagInput.tsx": "Empty file with no implementation.",
  "frontend/src/components/TechniqueLibrary.tsx": "Renders a searchable, filterable list of techniques with category tabs and a dialog for adding new techniques.",
  "frontend/src/components/TrainingHeatMap.tsx": "Generates a yearly heatmap of training hours using local date mapping and reacts to theme changes.",
  "frontend/src/components/TrainingHoursHeatMap.tsx": "Builds a detailed ISO‑weekday–aligned yearly hours grid with editing, saving, and color‑coded intensity.",
  "frontend/src/components/TrainingLog.tsx": "Displays training session logs with charts, analytics, and an add/edit dialog, fetching sessions and computing metrics like volume, intensity, and correlations.",
  "frontend/src/components/TrainingMonthCalendar.tsx": "Renders a month-view calendar of sessions with date grouping, navigation, and styling based on session types, supporting edit callbacks and scroll-dragging.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user's identity, refetching dependent queries when the actor changes.",
  "frontend/src/hooks/useActorReady.ts": "Empty file with no implementation.",
  "frontend/src/hooks/useActorWrapper.ts": "Enhanced actor initialization hook with detailed step logging, creating authenticated or anonymous actors and invalidating dependent queries.",
  "frontend/src/hooks/useDragToScroll.ts": "Provides a ref enabling drag-to-scroll behavior on an element using pointer events.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity provider and hook managing authentication, identity loading, login state, and AuthClient integration.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for fetching and mutating user profiles, registration, and training records using an actor wrapper.",
  "frontend/src/index.css": "Tailwind base styles plus custom CSS variables, BJJ color utilities, dark mode theming, and gradient/animation helpers.",
  "frontend/src/lib/beltStatsCalculator.ts": "Computes gamified belt statistics from training sessions and submission logs, including progression, experience, submissions, and mastery.",
  "frontend/src/lib/beltUtils.ts": "Utility functions for belt image URLs, belt naming, and preloading all belt images.",
  "frontend/src/lib/formatters.ts": "Maps session theme enums to human-readable labels.",
  "frontend/src/lib/imageCache.ts": "In-memory image preloading and caching to prevent flicker during navigation.",
  "frontend/src/lib/intensityUtils.ts": "Utilities for intensity labels, badges, numeric conversion, and predefined intensity options.",
  "frontend/src/lib/moodIcons.ts": "Maps mood ratings to labels and colors with helpers for retrieving mood data.",
  "frontend/src/lib/submissionLogUtils.ts": "Utility functions for normalizing, finding, modifying, and merging submission log entries.",
  "frontend/src/lib/submissionOptions.ts": "Exports a constant alphabetized list of BJJ submission names and a type representing any valid submission option.",
  "frontend/src/lib/submissionsListLoader.ts": "Empty file with no implementation.",
  "frontend/src/lib/trainingAnalytics.ts": "Provides analytics utilities for training data, including favorite theme, intensity averages, submission counting, time bucketing, and roll averages.",
  "frontend/src/lib/utils.ts": "Contains class name merging helpers, local-time date utilities, color mapping for heat maps, and functions for generating a year heat‑map grid.",
  "frontend/src/main.tsx": "Initializes React, sets up React Query and Internet Identity provider, and renders the main App component.",
  "frontend/src/pages/Dashboard.tsx": "Implements the dashboard UI with tabbed navigation for analytics, training log, belt tracking, and techniques.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, persisting, and clearing URL parameters and session-stored values.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining theme extensions, color tokens, animations, and plugin setup.",
  "project_state.json": "Defines project metadata, versioning, and a detailed list of existing app features including authentication, actor initialization, secret handling, debug tools, RBAC, and data-access hooks. Serves as the authoritative state snapshot for planning and feature tracking."
}