{
  "backend/main.mo": "Defines the backend actor with all domain types for training sessions, user profiles, belt progression, goals, milestones, achievements, and related data structures.",
  "feature_evidence.json": "Feature evidence record describing tooltip text requirements for per-belt submission proficiency along with linked files, components, and confidence.",
  "frontend-file-summaries.txt": "Contains prewritten summaries of multiple frontend source files describing their purpose and behavior.",
  "frontend/DRAFT_127_REDEPLOY_ASSERTION.md": "Documentation asserting Draft 127 is a zero‑change redeploy with verification steps and deployment placeholders.",
  "frontend/DRAFT_128_REDEPLOY_ASSERTION.md": "Redeploy assertion for Draft 128 confirming zero code changes and providing a verification checklist.",
  "frontend/DRAFT_132_REDEPLOY_ASSERTION.md": "Redeploy assertion for Draft 132 indicating a zero‑change redeploy with deployment record placeholders.",
  "frontend/DRAFT_135_REDEPLOY_ASSERTION.md": "Redeploy assertion for Draft 135 confirming no code, schema, or functional changes with deployment checklists.",
  "frontend/index.css": "Tailwind‑based stylesheet defining light and dark theme CSS variables and base styles.",
  "frontend/index.html": "Base HTML file mounting the frontend app and loading the main TypeScript entrypoint.",
  "frontend/REBUILD_DEPLOY_DRAFT_105.md": "Clean rebuild/redeploy documentation for Draft 105 with pre‑rebuild state notes and procedure steps.",
  "frontend/REBUILD_DEPLOY_DRAFT_110.md": "Clean rebuild/redeploy guide for Draft 110 outlining verification and deployment commands.",
  "frontend/REBUILD_DEPLOY_DRAFT_115.md": "Documentation for Draft 115 rebuild/redeploy with checklists and deployment instructions.",
  "frontend/REBUILD_DEPLOY_DRAFT_125.md": "Clean rebuild/redeploy instructions for Draft 125 with purpose, checklists, and command placeholders.",
  "frontend/REBUILD_DEPLOY_DRAFT_127.md": "Redeploy guide for Draft 127 noting no code changes and including pre‑deployment checks.",
  "frontend/REBUILD_DEPLOY_DRAFT_128.md": "Clean redeploy document for Draft 128 confirming zero code changes and listing pre‑deployment steps.",
  "frontend/REBUILD_DEPLOY_DRAFT_94.md": "Rebuild/redeploy checklist for Draft 94 detailing pre‑rebuild state and backend/frontend steps.",
  "frontend/REDEPLOY_NOTE_DRAFT_105.md": "Redeploy note template for Draft 105 with deployment steps, status fields, and placeholders.",
  "frontend/REDEPLOY_NOTE_DRAFT_110.md": "Redeploy note for Draft 110 including deployment status options, steps executed, and error reporting fields.",
  "frontend/REDEPLOY_NOTE_DRAFT_115.md": "Template redeploy note for Draft 115 with checklists, canister info, and failure reporting sections.",
  "frontend/REDEPLOY_NOTE_DRAFT_125.md": "Redeploy note for Draft 125 documenting deployment metadata, steps, outcomes, and error placeholders.",
  "frontend/REDEPLOY_NOTE_DRAFT_127.md": "Notes a quick redeploy of Draft 127 with no code changes and placeholders for any failing steps or errors.",
  "frontend/REDEPLOY_NOTE_DRAFT_128.md": "Documents a clean redeploy of Draft 128 with no code changes and includes empty sections for deployment steps and errors.",
  "frontend/REDEPLOY_NOTE_DRAFT_132.md": "Indicates Draft 132 is a no‑change redeploy with placeholders for date/time and executed commands.",
  "frontend/REDEPLOY_NOTE_DRAFT_135.md": "Describes Draft 135 as a no‑change redeploy including outlined deployment steps and placeholders for results and errors.",
  "frontend/REDEPLOY_NOTE_TEMPLATE.md": "Template for redeploy notes including fields for deployment targets, failing steps, and error output.",
  "frontend/SMOKE_CHECK_DRAFT_105.md": "Smoke‑check checklist for Draft 105 focused on verifying login screen rendering and absence of errors.",
  "frontend/SMOKE_CHECK_DRAFT_110.md": "Smoke‑check for Draft 110 with initial load checks and placeholders for console errors and deployment info.",
  "frontend/SMOKE_CHECK_DRAFT_115.md": "Smoke‑check for Draft 115 verifying initial load, login rendering, and Internet Identity visibility.",
  "frontend/SMOKE_CHECK_DRAFT_125.md": "Smoke‑check for Draft 125 validating basic app load and capturing console errors or notes.",
  "frontend/SMOKE_CHECK_DRAFT_127.md": "Detailed smoke‑check for Draft 127 covering load, authentication, actor initialization, dashboard, and profile gating.",
  "frontend/SMOKE_CHECK_DRAFT_128.md": "Smoke‑check for Draft 128 verifying initial load, branding, login functionality, and console output.",
  "frontend/SMOKE_CHECK_DRAFT_135.md": "Comprehensive smoke‑check for Draft 135 covering load, authentication, post‑login behavior, and error reporting.",
  "frontend/src/App.tsx": "Main app component handling authentication, actor initialization, profile loading, theming, and routing between screens.",
  "frontend/src/components/AddTechniqueDialog.tsx": "Dialog component for adding a technique with fields, tag management, YouTube thumbnail detection, and submission logic.",
  "frontend/src/components/AddTrainingDialog.tsx": "Dialog component for creating or editing training sessions with fields for date, duration, type, theme, rolls, mood, and intensity.",
  "frontend/src/components/Analytics.tsx": "Empty placeholder component.",
  "frontend/src/components/BeltTracker.tsx": "Displays belt progression, training stats, and submission proficiency using user data and gamified calculations.",
  "frontend/src/components/CachedImage.tsx": "Image component that preloads sources and swaps to a fallback on load failure with fade‑in behavior.",
  "frontend/src/components/CompletedBeltStageStatsCard.tsx": "Card showing preserved stats for a completed belt stage, including progression, experience, and submission proficiency.",
  "frontend/src/components/DebugOverlay.tsx": "Empty placeholder component.",
  "frontend/src/components/Footer.tsx": "Simple footer displaying credits and a link to caffeine.ai.",
  "frontend/src/components/Header.tsx": "Header with branding, profile access, theme toggle, and logout functionality using Internet Identity.",
  "frontend/src/components/LoginScreen.tsx": "Login screen using Internet Identity with branding and feature highlights.",
  "frontend/src/components/Profile.tsx": "Empty placeholder component.",
  "frontend/src/components/ProfileAnalytics.tsx": "Displays user training analytics including totals, streaks, intensity, themes, and submissions using profile, session, and submission logs.",
  "frontend/src/components/ProfileSetup.tsx": "Provides a form to create or edit a user profile, handling belt level, gym info, profile pictures, and practitioner start date.",
  "frontend/src/components/SubmissionLogSection.tsx": "Manages viewing and editing of the user's submission log with belt-based organization, duplicate merging, and save functionality.",
  "frontend/src/components/SubmissionSelectInput.tsx": "Searchable popover input for adding submissions, filtering available options and preventing duplicates.",
  "frontend/src/components/SubmissionTagInput.tsx": "Empty placeholder component file.",
  "frontend/src/components/TechniqueLibrary.tsx": "Renders a searchable and filterable technique list with category tabs and an option to add new techniques.",
  "frontend/src/components/TrainingHeatMap.tsx": "Renders a yearly training heatmap with local‑time date mapping, theme‑responsive color recalculation, and month/weekday grid generation.",
  "frontend/src/components/TrainingHoursHeatMap.tsx": "Provides an editable yearly training‑hours heatmap with ISO‑weekday grid generation, CRUD hooks, and custom hour‑based coloring.",
  "frontend/src/components/TrainingLog.tsx": "Displays training analytics, charts, and session management, including volume, ratios, trends, and an add/edit dialog.",
  "frontend/src/components/TrainingMonthCalendar.tsx": "Shows a scrollable month calendar grouping sessions by date with type‑based styling and editing hooks.",
  "frontend/src/hooks/useActor.ts": "Initializes an authenticated or anonymous backend actor via React Query and refreshes dependent queries when identity changes.",
  "frontend/src/hooks/useActorReady.ts": "Empty placeholder hook file.",
  "frontend/src/hooks/useActorWrapper.ts": "Enhanced actor initialization hook with detailed step logging, identity handling, actor creation, and debug log buffering.",
  "frontend/src/hooks/useDragToScroll.ts": "Implements a hook that enables drag-to-scroll behavior on any scrollable element using pointer events. Returns a ref to attach to the target element.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for managing Internet Identity authentication, including login, logout, stored identity loading, and status tracking. Wraps Dfinity AuthClient with custom handling of identity persistence and error states.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for loading, saving, and registering user profiles and training data via the actor API. Includes error handling, cache invalidation, and toast notifications.",
  "frontend/src/index.css": "Configures Tailwind base styles and defines a set of custom OKLCH-driven color variables including BJJ and gradient themes. Adds utility classes for text, backgrounds, and animated gradient effects.",
  "frontend/src/lib/beltStatsCalculator.ts": "Calculates gamified belt progression stats based on training sessions, submission logs, and belt stage history. Produces percentage and raw metrics for progression, experience, submissions, and mastery.",
  "frontend/src/lib/beltUtils.ts": "Provides helpers for generating belt image URLs, formatting belt names, and preloading belt images. Supports all belt levels and stripe counts.",
  "frontend/src/lib/formatters.ts": "Maps session theme enums to human-readable labels. Returns a fallback string if a theme is unrecognized.",
  "frontend/src/lib/imageCache.ts": "Implements a simple in-memory cache for preloading images to avoid flicker during navigation. Supports clearing the cache when needed.",
  "frontend/src/lib/intensityUtils.ts": "Defines intensity options and helpers to get labels, shorthand codes, colors, and numeric mappings for training intensity. Also converts numeric averages back to intensity labels.",
  "frontend/src/lib/moodIcons.ts": "Maps mood ratings to labels and hex colors and provides helpers for lookup.",
  "frontend/src/lib/submissionLogUtils.ts": "Utility functions to normalize, find, add, remove, increment, decrement, and merge BJJ submission entries.",
  "frontend/src/lib/submissionOptions.ts": "Exports a comprehensive alphabetized list of BJJ submission names and its type.",
  "frontend/src/lib/submissionProficiencyTooltipCopy.ts": "Defines tooltip text per belt level and provides a getter for it.",
  "frontend/src/lib/submissionsListLoader.ts": "Empty placeholder file with no implementation.",
  "frontend/src/lib/trainingAnalytics.ts": "Provides analytics utilities for sessions including favorite theme, intensity, unique submissions, time bucketing, and roll averages.",
  "frontend/src/lib/utils.ts": "Utility helpers for class merging, date handling, weekday mapping, heatmap colors, and generating year grid data.",
  "frontend/src/main.tsx": "Initializes React app with QueryClient and Internet Identity provider.",
  "frontend/src/pages/Dashboard.tsx": "Renders the main dashboard with tabs for analytics, log, belt tracker, and techniques.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, storing, and clearing URL and session-based parameters.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining content paths, theme extensions (colors, animations, radius, shadows), and loading typography, container-queries, and animate plugins.",
  "project_state.json": "Project state metadata describing versioning, a high-level summary of major feature expansions, and a list of existing features with IDs, descriptions, and version info."
}