{
  "backend/main.mo": "Defines the Motoko canister actor with all user, training, belt, technique, and analytics-related types used by the backend.",
  "feature_evidence.json": "Contains feature evidence records for promotion and smoke‑check tasks tied to Draft 137 with associated files, components, and test IDs.",
  "frontend-file-summaries.txt": "Provides short summaries of major frontend source files including components, hooks, pages, and dialogs.",
  "frontend/DRAFT_127_REDEPLOY_ASSERTION.md": "Documents a zero‑change quick redeploy for Draft 127 with verification checklist and deployment info fields.",
  "frontend/DRAFT_128_REDEPLOY_ASSERTION.md": "Records the zero‑change redeploy assertion for Draft 128 with purpose, status fields, and verification checklist.",
  "frontend/DRAFT_132_REDEPLOY_ASSERTION.md": "Asserts that Draft 132 is redeployed with no code, schema, or state changes for pipeline verification.",
  "frontend/DRAFT_135_REDEPLOY_ASSERTION.md": "Specifies that Draft 135 is a no‑changes redeploy from Draft 134 with deployment info and verification checklist.",
  "frontend/DRAFT_137_REDEPLOY_ASSERTION.md": "Declares Draft 137 as a production promotion with zero code changes and provides production‑focused verification steps.",
  "frontend/index.css": "Tailwind-based global stylesheet defining light/dark theme variables and base styles.",
  "frontend/index.html": "HTML entry point that mounts the React app and loads the main TypeScript module.",
  "frontend/REBUILD_DEPLOY_DRAFT_105.md": "Documentation for a clean rebuild and redeploy of Draft 105 with no functional or schema changes, including pre‑rebuild checks.",
  "frontend/REBUILD_DEPLOY_DRAFT_110.md": "Outlines the clean rebuild/redeploy procedure for Draft 110 with pre‑deployment checklist and command sections.",
  "frontend/REBUILD_DEPLOY_DRAFT_115.md": "Tracks the clean rebuild and redeploy of Draft 115 with no code changes and includes pre‑deployment checks.",
  "frontend/REBUILD_DEPLOY_DRAFT_125.md": "Documents the clean rebuild and redeploy of Draft 125 with no modifications and includes pre‑deployment steps.",
  "frontend/REBUILD_DEPLOY_DRAFT_127.md": "Describes the clean rebuild and redeploy process for Draft 127 with confirmation of no changes.",
  "frontend/REBUILD_DEPLOY_DRAFT_128.md": "Records the rebuild/redeploy steps for Draft 128 ensuring zero source code changes and referencing the assertion doc.",
  "frontend/REBUILD_DEPLOY_DRAFT_94.md": "Provides rebuild and redeploy notes for Draft 94 with pre‑rebuild state and clean deployment steps.",
  "frontend/REDEPLOY_NOTE_DRAFT_105.md": "Redeploy note template for Draft 105 capturing deployment status, steps, and backend/frontend actions.",
  "frontend/REDEPLOY_NOTE_DRAFT_110.md": "Redeploy note for Draft 110 summarizing deployment targets, status, steps executed, and error reporting fields.",
  "frontend/REDEPLOY_NOTE_DRAFT_115.md": "Template for documenting Draft 115 redeploy details, steps taken, canister info, and any failures or errors.",
  "frontend/REDEPLOY_NOTE_DRAFT_125.md": "Draft 125 redeploy log template capturing deployment metadata, step statuses, canister IDs, and final outcome.",
  "frontend/REDEPLOY_NOTE_DRAFT_127.md": "Quick redeploy note for Draft 127 with sections for failure details, error locations, and verbatim output.",
  "frontend/REDEPLOY_NOTE_DRAFT_128.md": "Template for Draft 128 redeploy including context, steps, and placeholders for any failing step or errors.",
  "frontend/REDEPLOY_NOTE_DRAFT_132.md": "Minimal Draft 132 redeploy note with fields for timing, deployment type, and executed commands.",
  "frontend/REDEPLOY_NOTE_DRAFT_135.md": "Draft 135 redeploy record outlining intent, unchanged code, deployment steps, and final status.",
  "frontend/REDEPLOY_NOTE_DRAFT_137.md": "Draft 137 production promotion note documenting steps, unchanged code, and outcome placeholders.",
  "frontend/REDEPLOY_NOTE_TEMPLATE.md": "Generic template for redeploy notes covering target components, failure steps, locations, and error logs.",
  "frontend/SMOKE_CHECK_DRAFT_105.md": "Smoke test checklist for Draft 105 focusing on initial load and login screen verification.",
  "frontend/SMOKE_CHECK_DRAFT_110.md": "Draft 110 smoke check covering initial load validation and deployment environment details.",
  "frontend/SMOKE_CHECK_DRAFT_115.md": "Smoke test template for Draft 115 verifying application load and Internet Identity behavior.",
  "frontend/SMOKE_CHECK_DRAFT_125.md": "Draft 125 smoke check verifying initial load and capturing notes or console errors.",
  "frontend/SMOKE_CHECK_DRAFT_127.md": "Comprehensive smoke test for Draft 127 covering load, authentication, actor setup, dashboard, and profile flow.",
  "frontend/SMOKE_CHECK_DRAFT_128.md": "Draft 128 smoke check validating initial load, branding, login, and console conditions.",
  "frontend/SMOKE_CHECK_DRAFT_135.md": "Draft 135 smoke test covering load, authentication, dashboard behavior, and console/network errors.",
  "frontend/SMOKE_CHECK_DRAFT_137.md": "Production smoke test for Draft 137 validating full app flow from load to dashboard and tooltip functionality.",
  "frontend/src/App.tsx": "Main React app component handling identity login, actor initialization, profile loading, and routing to setup or dashboard.",
  "frontend/src/components/AddTechniqueDialog.tsx": "Dialog component for creating techniques with fields, tag management, and YouTube thumbnail generation.",
  "frontend/src/components/AddTrainingDialog.tsx": "Dialog for adding or editing training sessions, handling date selection, session details, and mood/intensity inputs.",
  "frontend/src/components/Analytics.tsx": "Empty component placeholder for analytics content.",
  "frontend/src/components/BeltTracker.tsx": "Tracks belt progress using user data, training history, and submissions, displaying gamified stats and completed stages.",
  "frontend/src/components/CachedImage.tsx": "Image component that preloads and caches images with fallback and loading state handling.",
  "frontend/src/components/CompletedBeltStageStatsCard.tsx": "Displays preserved stats for a completed belt stage including progression, experience, and submission proficiency.",
  "frontend/src/components/DebugOverlay.tsx": "Empty debug overlay component placeholder.",
  "frontend/src/components/Footer.tsx": "Simple footer showing copyright and link attribution.",
  "frontend/src/components/Header.tsx": "Header with app branding, profile access, theme toggle, and logout functionality.",
  "frontend/src/components/LoginScreen.tsx": "Login screen UI that triggers Internet Identity authentication and displays feature highlights.",
  "frontend/src/components/Profile.tsx": "Empty placeholder component; no implementation provided.",
  "frontend/src/components/ProfileAnalytics.tsx": "Displays user profile analytics including sessions, submissions, streaks, and belt data using multiple hooks and computed metrics.",
  "frontend/src/components/ProfileSetup.tsx": "Form for creating or editing a user profile, including belt info, gym details, and profile picture upload.",
  "frontend/src/components/SubmissionLogSection.tsx": "Manages viewing and editing submission logs per belt level with duplicate handling and save functionality.",
  "frontend/src/components/SubmissionSelectInput.tsx": "Searchable popover input for selecting submissions from predefined options while excluding existing ones.",
  "frontend/src/components/SubmissionTagInput.tsx": "Empty placeholder component; no implementation provided.",
  "frontend/src/components/TechniqueLibrary.tsx": "Displays and filters a list of techniques by search and category, with UI to add new techniques.",
  "frontend/src/components/TrainingHeatMap.tsx": "Renders a year-based training heat map using local-time date mapping, theme-aware color updates, and month labels computed from weekly grids.",
  "frontend/src/components/TrainingHoursHeatMap.tsx": "Displays an editable training-hours heat map with ISO weekday–aligned grids, color thresholds, and mutation hooks for updating stored hours.",
  "frontend/src/components/TrainingLog.tsx": "Provides the main training log UI with session creation, editing, analytics charts, and aggregated statistics.",
  "frontend/src/components/TrainingMonthCalendar.tsx": "Shows a scrollable month calendar with day-by-day session grouping, type-based coloring, and navigation between months.",
  "frontend/src/hooks/useActor.ts": "Initializes and caches an authenticated or anonymous backend actor and refreshes dependent queries when the actor changes.",
  "frontend/src/hooks/useActorReady.ts": "Empty placeholder file.",
  "frontend/src/hooks/useActorWrapper.ts": "Enhanced actor initialization hook that logs step-by-step auth and actor creation events and rebuilds the actor based on identity changes.",
  "frontend/src/hooks/useDragToScroll.ts": "Provides a hook enabling drag-to-scroll behavior via pointer events on a referenced element.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity auth context with login, logout, identity loading, and status tracking using Dfinity AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating user profiles and training-related data via an actor wrapper.",
  "frontend/src/index.css": "Configures Tailwind base styles, theme variables, BJJ color utilities, and gradient animations.",
  "frontend/src/lib/beltStatsCalculator.ts": "Calculates belt progression, experience, submission proficiency, and mastery stats from training and submission data.",
  "frontend/src/lib/beltUtils.ts": "Provides helpers for belt image URLs, names, and preloading belt images.",
  "frontend/src/lib/formatters.ts": "Maps session theme enums to human-readable labels.",
  "frontend/src/lib/imageCache.ts": "Implements a simple in-memory image preload cache to prevent image flashing.",
  "frontend/src/lib/intensityUtils.ts": "Supplies intensity metadata, labels, badge colors, and numeric conversions for training intensity values.",
  "frontend/src/lib/moodIcons.ts": "Maps mood ratings to labels and colors and provides helpers to retrieve labels and hex colors.",
  "frontend/src/lib/submissionLogUtils.ts": "Utility functions for normalizing, finding, adding, removing, incrementing, decrementing, and merging BJJ submission entries.",
  "frontend/src/lib/submissionOptions.ts": "Exports a comprehensive alphabetical list of BJJ submission technique names and its type definition.",
  "frontend/src/lib/submissionProficiencyTooltipCopy.ts": "Defines tooltip text per belt level and a helper to retrieve the correct Submission Proficiency tooltip.",
  "frontend/src/lib/submissionsListLoader.ts": "Empty placeholder file with no implementation.",
  "frontend/src/lib/trainingAnalytics.ts": "Provides analytics utilities for sessions including themes, intensity, unique submissions, time bucketing, and roll averages.",
  "frontend/src/lib/utils.ts": "Provides class name merging and date utilities plus heat‑map color logic and year grid generation using ISO weekday rules.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentity providers and renders the root component.",
  "frontend/src/pages/Dashboard.tsx": "Renders the main dashboard with tabbed navigation for analytics, training log, belt tracker, and techniques.",
  "frontend/src/utils/urlParams.ts": "Helpers for reading, storing, retrieving, and clearing URL and session-based parameters, including hash routing support.",
  "frontend/tailwind.config.js": "Configures Tailwind with dark mode, custom OKLCH color tokens, extended layout/animation utilities, and typography/container-query/animation plugins.",
  "project_state.json": "Defines the project’s versioned state and lists existing app features, including authentication, actor initialization, admin token handling, debugging tools, RBAC, and React Query integration."
}