{
  "backend/main.mo": "Defines core Motoko actor types for training sessions, belt progress, user profiles, techniques, goals, and analytics data structures. No functional logic is shown, only type and structure definitions.",
  "feature_evidence.json": "Feature evidence report listing draft redeploy features, related files, components, and test IDs for verification.",
  "frontend-file-summaries.txt": "JSON-style map summarizing key frontend source files and their roles across app components, hooks, utilities, and pages.",
  "frontend/index.css": "Tailwind setup defining light and dark theme CSS variables and applying base background and border styles.",
  "frontend/index.html": "HTML entry point mounting the app root and loading the main TypeScript bundle.",
  "frontend/REBUILD_DEPLOY_DRAFT_105.md": "Documentation for clean rebuild and redeploy of Draft 105 with no code or schema changes, including pre‑checks and procedure steps.",
  "frontend/REBUILD_DEPLOY_DRAFT_110.md": "Clean rebuild/redeploy instructions for Draft 110 with checklists and backend/frontend deployment commands.",
  "frontend/REBUILD_DEPLOY_DRAFT_115.md": "Redeploy documentation for Draft 115 outlining purpose, constraints, and pre‑deployment verification steps.",
  "frontend/REBUILD_DEPLOY_DRAFT_125.md": "Clean rebuild/redeploy notes for Draft 125 with version metadata, checklist, and build/deployment steps.",
  "frontend/REBUILD_DEPLOY_DRAFT_94.md": "Rebuild/redeploy checklist for Draft 94 documenting purpose, prerequisites, and backend deployment steps.",
  "frontend/REDEPLOY_NOTE_DRAFT_105.md": "Template-like redeploy note for Draft 105 covering deployment metadata, status, and step checklists.",
  "frontend/REDEPLOY_NOTE_DRAFT_110.md": "Redeploy summary for Draft 110 including deployment targets, status options, and step-by-step tracking.",
  "frontend/REDEPLOY_NOTE_DRAFT_115.md": "Redeploy note template for Draft 115 listing deployment info, steps executed, and failure reporting fields.",
  "frontend/REDEPLOY_NOTE_DRAFT_125.md": "Redeploy note for Draft 125 documenting metadata, canister IDs, executed steps, and outcome fields.",
  "frontend/REDEPLOY_NOTE_TEMPLATE.md": "Generic redeploy note template capturing deployment targets, failure steps, and error output.",
  "frontend/SMOKE_CHECK_DRAFT_105.md": "Smoke check checklist for Draft 105 focusing on login screen rendering and initial load validation.",
  "frontend/SMOKE_CHECK_DRAFT_110.md": "Smoke check for Draft 110 verifying initial load, branding, and console‑error‑free startup.",
  "frontend/SMOKE_CHECK_DRAFT_115.md": "Smoke test checklist for Draft 115 verifying baseline app load and login functionality.",
  "frontend/SMOKE_CHECK_DRAFT_125.md": "Smoke check for Draft 125 confirming application loads correctly and logs any console errors.",
  "frontend/src/App.tsx": "Main app component handling authentication, actor initialization, theme loading, and routing between login, profile setup, and dashboard states.",
  "frontend/src/components/AddTechniqueDialog.tsx": "Dialog component for creating techniques with fields, tag management, YouTube thumbnail detection, and submission handling.",
  "frontend/src/components/AddTrainingDialog.tsx": "Dialog for adding or editing training sessions with date, duration, mood, and theme selection, syncing with backend queries.",
  "frontend/src/components/Analytics.tsx": "Empty placeholder component for analytics features.",
  "frontend/src/components/BeltTracker.tsx": "Component displaying and updating belt progress with gamified stats and cached belt images.",
  "frontend/src/components/CachedImage.tsx": "Image component that preloads and caches images with fallback handling and loading state.",
  "frontend/src/components/DebugOverlay.tsx": "Debug overlay showing Internet Identity, actor initialization state, logs, and progress with a toggleable panel.",
  "frontend/src/components/Footer.tsx": "Simple footer displaying copyright text and a link to caffeine.ai with a heart icon.",
  "frontend/src/components/Header.tsx": "Header with branding, profile access, theme toggle, debug toggle, and logout handling based on authentication state.",
  "frontend/src/components/LoginScreen.tsx": "Login screen for Internet Identity with status handling and introductory UI elements.",
  "frontend/src/components/Profile.tsx": "Empty placeholder file with no implemented content.",
  "frontend/src/components/ProfileAnalytics.tsx": "Generates user training statistics, streaks, submissions, and profile details with multiple analytics visualizations.",
  "frontend/src/components/ProfileSetup.tsx": "Profile creation/editing form handling username, belt progress, gym data, practitioner date, and profile picture upload.",
  "frontend/src/components/SubmissionLogSection.tsx": "Manages a user's submission log by belt level, syncing with backend data, detecting unsaved changes, and providing UI for adding, removing, and saving submissions.",
  "frontend/src/components/SubmissionSelectInput.tsx": "Provides a searchable popover input for adding submission names, filtering options and preventing duplicates.",
  "frontend/src/components/SubmissionTagInput.tsx": "Empty placeholder file with no implemented content.",
  "frontend/src/components/TechniqueLibrary.tsx": "Displays a searchable, filterable list of techniques grouped by category and allows adding new techniques.",
  "frontend/src/components/TrainingHeatMap.tsx": "Generates a year-based heatmap of training hours using local-date mapping, theme-aware coloring, and session data aggregation.",
  "frontend/src/components/TrainingHoursHeatMap.tsx": "Builds a weekly ISO-aligned heatmap grid for training hours, with date normalization, color thresholds, and CRUD operations for hour entries.",
  "frontend/src/components/TrainingLog.tsx": "Renders the training log page with charts, analytics, and session management using training data and dialogs.",
  "frontend/src/components/TrainingMonthCalendar.tsx": "Displays a monthly calendar of training sessions with date grouping, styling, and month navigation.",
  "frontend/src/hooks/useActor.ts": "Initializes and returns a backend actor based on the current identity, refreshing dependent queries when it changes.",
  "frontend/src/hooks/useActorReady.ts": "Empty file.",
  "frontend/src/hooks/useActorWrapper.ts": "Enhanced actor initialization hook with step-by-step logging, authentication state tracking, and admin token handling.",
  "frontend/src/hooks/useDragToScroll.ts": "Provides a ref enabling drag-to-scroll behavior on any scrollable element.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity authentication context, including login, identity loading, and status tracking.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks for fetching and mutating user profiles, registration, and training-related data using an actor API.",
  "frontend/src/index.css": "Defines Tailwind base styles, theme variables, BJJ-specific colors, utilities, and custom scrollbar styling.",
  "frontend/src/lib/beltStatsCalculator.ts": "Calculates gamified belt progression, experience, submission proficiency, and technique mastery from training sessions and submission logs.",
  "frontend/src/lib/beltUtils.ts": "Generates belt image URLs, readable belt names, and preloads belt images for caching.",
  "frontend/src/lib/formatters.ts": "Maps session theme enums to human-readable labels.",
  "frontend/src/lib/imageCache.ts": "Implements a simple in-memory image preload cache to avoid image flashing.",
  "frontend/src/lib/intensityUtils.ts": "Provides intensity metadata, labels, colors, and numeric conversions for training intensity values.",
  "frontend/src/lib/moodIcons.ts": "Maps mood ratings to icon assets and labels, with helpers to retrieve all mood icons.",
  "frontend/src/lib/submissionLogUtils.ts": "Utilities for normalizing, finding, adding, removing, incrementing, decrementing, and merging submission log entries.",
  "frontend/src/lib/submissionOptions.ts": "Exports a constant list of BJJ submission technique names and a type representing any entry.",
  "frontend/src/lib/submissionsListLoader.ts": "Empty file with no implementation.",
  "frontend/src/lib/trainingAnalytics.ts": "Provides training analytics utilities including theme stats, intensity averages, submission counting, time bucketing, and roll averages.",
  "frontend/src/lib/utils.ts": "Contains utility helpers for class merging, local date handling, week mapping, color selection, and heatmap grid generation.",
  "frontend/src/main.tsx": "Initializes the React app with QueryClient and InternetIdentity providers and renders the root component.",
  "frontend/src/pages/Dashboard.tsx": "Implements a tabbed dashboard UI displaying analytics, training log, belt tracker, and technique library.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, persisting, and clearing URL and sessionStorage parameters, supporting hash-based routing.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining theme extensions, colors, animations, and plugins.",
  "project_state.json": "Holds the project’s versioned state, a high‑level app summary, and a list of implemented features with IDs, descriptions, synonyms, and versions. Used as a structured overview of existing ICP dapp capabilities such as auth, actor init, RBAC, queries, and profile/session handling."
}