{
  "kind": "build_request",
  "title": "Move Training Heat Map into Training Statistics card and remove debug/bug UI features",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Move the existing Training Heat Map rendering in `frontend/src/components/ProfileAnalytics.tsx` so it appears inside the \"Training Statistics\" card, positioned directly under the 6 metric tiles, while keeping the heat map’s current functionality and sizing (same grid cell size, same scroll behavior, same year selector/legend behavior, same computed totals). Remove the standalone \"Training Heat Map\" section that currently renders below the profile/statistics cards.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Can we move the Training Heat Map into the Training Statistics area under the 6 metrics keeping the same functionality/sizing as now."
        ]
      },
      "acceptanceCriteria": [
        "On the Profile Analytics tab, the Training Heat Map is rendered within the \"Training Statistics\" card, beneath the 6 metric tiles.",
        "The Training Heat Map no longer appears as a separate section outside/below the statistics card.",
        "Heat map behavior is unchanged: year navigation (prev/next + dropdown), day selection, legend, theme-aware coloring updates, and loading state work as they did previously.",
        "Heat map sizing is unchanged: day cells remain 12px squares (`w-3 h-3`), and the grid retains its current overflow/scroll behavior."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Remove the \"bug\"/debug features from the user-facing UI: remove the debug toggle button (Bug icon) from `frontend/src/components/Header.tsx` and stop rendering the debug overlay from `frontend/src/App.tsx` in all app states (initializing, login, actor-connecting, profile-loading, profile-setup, loaded, fallback).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Also remove the bugs features elsewhere."
        ]
      },
      "acceptanceCriteria": [
        "There is no Bug icon button in the header and no user-facing control labeled or intended for debug mode.",
        "The debug overlay is not rendered anywhere in the application UI across all authentication/initialization states.",
        "App functionality unrelated to debug UI (login, profile setup, dashboard navigation) continues to work without requiring debug-mode localStorage flags or page reloads."
      ]
    }
  ],
  "constraints": [
    "Do not change backend APIs or data schemas; this request is a UI/layout change plus removal of user-facing debug UI.",
    "Do not edit files under `frontend/src/components/ui` (read-only UI library components).",
    "Use English for any user-facing text."
  ],
  "nonGoals": [
    "Do not redesign the Training Heat Map visualization or change its calculations, thresholds, or color palette logic.",
    "Do not add new analytics metrics or new dashboard tabs.",
    "Do not implement new debugging features; the request is to remove existing bug/debug features from the UI."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}