{
  "kind": "build_request",
  "title": "Promote current draft build to live (production) canister",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Promote the currently deployed draft build (Draft Version 137) to the live (production) canister without introducing additional code or schema changes.",
      "target": "unknown",
      "source": {
        "messageIds": [
          "msg-7"
        ],
        "quotes": [
          "1. yes"
        ]
      },
      "acceptanceCriteria": [
        "The live (production) canister is updated to match Draft Version 137.",
        "No frontend or backend code changes are introduced as part of the promotion.",
        "No backend schema/state migration is performed as part of the promotion."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Run a post-promotion smoke check on the live (production) deployment covering: initial app load, Internet Identity login/logout, actor initialization (no initialization trap), profile gating (profile setup vs dashboard), and verifying that submission proficiency tooltips render without errors.",
      "target": "unknown",
      "source": {
        "messageIds": [
          "msg-7"
        ],
        "quotes": [
          "1. yes"
        ]
      },
      "acceptanceCriteria": [
        "The app loads on production with no uncaught console errors.",
        "Users can log in via Internet Identity and reach the dashboard if a profile exists.",
        "If a profile does not exist, the user is routed to profile setup without flicker loops.",
        "Submission proficiency tooltips render (including Purple belt) and do not crash the UI."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under frontend.immutablePaths (read-only components/hooks).",
    "Respect the single-actor backend architecture (all Motoko logic remains in backend/main.mo).",
    "Do not add new features or UI changes; this request is a promotion-only action."
  ],
  "nonGoals": [
    "Changing tooltip copy or tooltip styling.",
    "Refactoring auth/actor/profile initialization logic.",
    "Any new backend endpoints, data model changes, or migrations.",
    "Any new images or asset generation."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}