{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Embed Training Heat Map into Training Statistics card and remove debug UI",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Render the existing Training Heat Map inside the Training Statistics card directly beneath the 6 metric tiles, and remove the standalone section below the cards while preserving all heat map behavior and sizing.",
      "acceptanceCriteria": [
        "On the Profile Analytics tab, the Training Heat Map is rendered within the \"Training Statistics\" card, beneath the 6 metric tiles.",
        "The Training Heat Map no longer appears as a separate section outside/below the statistics card.",
        "Heat map behavior is unchanged: year navigation (prev/next + dropdown), day selection, legend, theme-aware coloring updates, and loading state work as they did previously.",
        "Heat map sizing is unchanged: day cells remain 12px squares (`w-3 h-3`), and the grid retains its current overflow/scroll behavior."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/TrainingHeatMap.tsx",
          "operation": "modify",
          "description": "Add an embedded/in-card rendering mode so the heat map can be placed inside an existing parent card (Training Statistics) without introducing a nested standalone card section, while keeping the same year selector, legend, totals, theme-aware coloring recalculation, loading state, and the same grid sizing (`w-3 h-3`) and scroll/overflow behavior for the heat map container."
        },
        {
          "path": "frontend/src/components/ProfileAnalytics.tsx",
          "operation": "modify",
          "description": "Move the TrainingHeatMap rendering into the \"Training Statistics\" CardContent directly under the 6 metric tiles (using the heat map’s embedded/in-card mode), and remove the standalone \"Training Heat Map\" section that currently renders below the profile/statistics cards."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Remove all user-facing bug/debug UI controls and ensure the debug overlay is never rendered across any app state.",
      "acceptanceCriteria": [
        "There is no Bug icon button in the header and no user-facing control labeled or intended for debug mode.",
        "The debug overlay is not rendered anywhere in the application UI across all authentication/initialization states.",
        "App functionality unrelated to debug UI (login, profile setup, dashboard navigation) continues to work without requiring debug-mode localStorage flags or page reloads."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/Header.tsx",
          "operation": "modify",
          "description": "Remove the Bug icon import and the debug toggle button/handler so no debug-mode toggle is exposed in the header UI."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Remove DebugOverlay import and stop rendering the debug overlay in all app states (initializing, login, actor-connecting, profile-loading, profile-setup, loaded, fallback) so the overlay never appears."
        },
        {
          "path": "frontend/src/components/DebugOverlay.tsx",
          "operation": "delete",
          "description": "Delete the debug overlay component implementation to fully remove the user-facing debug panel from the codebase (ensuring no remaining imports/usages exist after App.tsx is updated)."
        }
      ]
    }
  ]
}