{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Google Lens-style animated multicolor gradient glow highlights (scoped to specific UI elements)",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Add a reusable, animated multicolor (blue→green→yellow→red) gradient glow highlight utility that looks good in light and dark themes and can be applied only where explicitly requested.",
      "acceptanceCriteria": [
        "A visible multicolor gradient glow effect animates subtly over time (not static).",
        "The effect renders appropriately in both light mode and dark mode (no unreadable text, no extreme bloom that reduces contrast).",
        "The effect is available as a reusable class or small set of classes that can be applied to multiple components without duplicating large style blocks."
      ],
      "file_operations": [
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "Define reusable CSS utility classes for a Google Lens-style animated multicolor gradient glow, including: (1) a text-focused glow utility for brand/title text, (2) a full-surface animated gradient background utility for active/primary buttons, and (3) a subtle rounded-surface glow utility for panels/tiles. Include light/dark theme-safe tuning via .dark overrides (e.g., reduced glow intensity and preserved contrast) and an animation keyframes block that subtly shifts gradient position over time."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Apply the animated Lens-style glow only to the header title text (“Jiu-Jitsu Journey”) and the desktop Profile button, leaving all other header controls unchanged.",
      "acceptanceCriteria": [
        "In the header, the “Jiu-Jitsu Journey” title shows the animated multicolor glow highlight.",
        "The desktop Profile button (username button) shows the animated multicolor glow highlight.",
        "Theme toggle and Logout button styling remain unchanged compared to current behavior (aside from any incidental layout shifts that must be avoided)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/Header.tsx",
          "operation": "modify",
          "description": "Update the header branding title element to include the reusable animated Lens-style text glow utility class, and update only the desktop profile button to include the reusable animated Lens-style glow styling (e.g., surface glow and/or subtle ring). Ensure theme toggle and Logout keep their current className/variant styling and do not receive any of the new Lens-style classes."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Apply the animated Lens-style multicolor gradient as the full background only for the selected dashboard tab buttons; inactive tabs keep existing styling.",
      "acceptanceCriteria": [
        "When a tab is active/selected, its full background shows the animated multicolor gradient (not just an outline).",
        "When a tab is not active, it does not show the multicolor gradient background/glow.",
        "Switching tabs updates the highlighted styling immediately and reliably."
      ],
      "file_operations": [
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "Add a scoped utility selector to support active tab styling without editing shadcn ui components, e.g., a class that targets the active TabsTrigger via its data-state attribute and applies the animated multicolor gradient background only when selected (plus light/dark-safe foreground handling)."
        },
        {
          "path": "frontend/src/pages/Dashboard.tsx",
          "operation": "modify",
          "description": "Apply a dedicated className hook (e.g., an app-specific class) to each TabsTrigger so that only triggers in the selected/active state render the animated multicolor gradient as the full background via the reusable CSS utilities; ensure inactive triggers retain current styling and do not receive the animated gradient background."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Apply the animated Lens-style glow only to the welcome/login page’s BJJ icon, the Internet Identity login button, and exactly four rounded areas (one info panel + three feature tiles), preserving readability in light and dark themes.",
      "acceptanceCriteria": [
        "The top BJJ icon shows the animated multicolor glow highlight.",
        "The “Login with Internet Identity” button shows the animated multicolor glow highlight.",
        "Exactly four rounded areas on the welcome page show the animated multicolor styling: the rounded info panel under the login button and the three feature tiles at the bottom.",
        "Other welcome page elements keep their current styling (no additional areas pick up the multicolor glow unintentionally)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/LoginScreen.tsx",
          "operation": "modify",
          "description": "Apply the reusable animated Lens-style utilities only to: (1) the top BJJ icon container, (2) the “Login with Internet Identity” button (full-surface animated gradient), (3) the rounded info panel under the login button, and (4) each of the three rounded feature tiles. Avoid adding the Lens-style classes to other elements on the page to keep changes strictly scoped and maintain light/dark accessibility."
        }
      ]
    }
  ]
}