{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Exact per-belt Submission Proficiency tooltip copy",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Update the Submission Proficiency tooltip to use exact, final per-belt English copy with the correct unique-submissions targets.",
      "acceptanceCriteria": [
        "White Belt tooltip text is exactly: \"Unique submissions for White Belt. Target: 5. Counts only on: Blue Belt and higher.\"",
        "Blue Belt tooltip text is exactly: \"Unique submissions for Blue Belt. Target: 25. Counts only on: Blue Belt and higher.\"",
        "Purple Belt tooltip text is exactly: \"Unique submissions for Purple Belt. Target: 40. Counts only on: Blue Belt and higher.\"",
        "Brown Belt tooltip text is exactly: \"Unique submissions for Brown Belt. Target: 60. Counts only on: Blue Belt and higher.\"",
        "Black Belt tooltip text is exactly: \"Unique submissions for Black Belt. Target: 80. Counts only on: Blue Belt and higher.\""
      ],
      "file_operations": [
        {
          "path": "frontend/src/lib/submissionProficiencyTooltipCopy.ts",
          "operation": "create",
          "description": "Add a single source of truth mapping each belt (White/Blue/Purple/Brown/Black) to the exact required Submission Proficiency tooltip string, matching punctuation/capitalization exactly."
        },
        {
          "path": "frontend/src/components/BeltTracker.tsx",
          "operation": "modify",
          "description": "Replace the current Submission Proficiency tooltip text with the exact per-belt tooltip string sourced from the new shared tooltip-copy module (ensuring the displayed text matches acceptance criteria exactly)."
        },
        {
          "path": "frontend/src/components/CompletedBeltStageStatsCard.tsx",
          "operation": "modify",
          "description": "Align the Submission Proficiency tooltip copy for completed belt stages to the same exact per-belt tooltip strings used elsewhere so the unique-submissions tooltip text remains consistent and matches the required wording."
        }
      ]
    }
  ]
}