{
  "schemaVersion": "1.0.0",
  "projectStateVersion": 3,
  "summary": "Jiu-Jitsu Journey is an Internet Computer (ICP) dapp for Brazilian Jiu-Jitsu practitioners to authenticate with Internet Identity, create a profile (belt/stripes, gym, optional avatar, practitioner-since date), log and edit training sessions, track belt progression with gamified stats, maintain a multi-belt “submissions landed” log, manage a personal technique library, and visualize training activity through a month calendar, analytics charts, and GitHub-style yearly heat maps (including an editable training-hours override heat map).",
  "existing_features": [
    {
      "id": "IF-1",
      "title": "Internet Identity authentication provider",
      "synonyms": [
        "InternetIdentityProvider",
        "useInternetIdentity",
        "AuthClient integration"
      ],
      "description": "Provides login/logout via Internet Identity using @dfinity/auth-client, restores an authenticated identity from storage on mount, and exposes identity and login lifecycle status via React context.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-2",
      "title": "Backend actor initialization wrapper with step tracking and diagnostics",
      "synonyms": [
        "useActorWrapper",
        "actorReady",
        "InitStep",
        "getActorInitLogs"
      ],
      "description": "Creates an anonymous or authenticated backend actor depending on authentication state, tracks init steps (auth started → identity retrieved → actor creating → ready), and records a small global log buffer for debugging.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-3",
      "title": "Secret token extraction from URL hash with session persistence",
      "synonyms": [
        "getSecretParameter",
        "getSecretFromHash",
        "urlParams utilities"
      ],
      "description": "Extracts sensitive parameters (e.g., caffeineAdminToken) from the URL hash fragment, persists to sessionStorage, and removes the secret from the URL via history.replaceState to reduce leakage via history/referrers.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-4",
      "title": "In-app debug overlay for auth/actor/profile diagnostics",
      "synonyms": [
        "DebugOverlay",
        "init progress panel",
        "actor log viewer"
      ],
      "description": "Toggleable debug panel showing initialization progress, step-by-step status, identity info, profile query status, elapsed time, and detailed actor init logs with warning/error highlighting.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-5",
      "title": "Backend role-based access control (RBAC) with admin bootstrap",
      "synonyms": [
        "authorization/access-control",
        "MixinAuthorization",
        "getCallerUserRole",
        "assignCallerUserRole"
      ],
      "description": "Motoko authorization module supports #admin/#user/#guest roles, can be initialized with an env-provided admin token plus a caller-provided secret, and exposes role lookup, admin checks, and admin-only role assignment.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-6",
      "title": "Centralized React Query hooks for backend reads/writes",
      "synonyms": [
        "useQueries",
        "TanStack Query data layer"
      ],
      "description": "Typed queries/mutations for user profile, registration, training sessions, belt progress, techniques, custom technique types, theme preference, training hours, and submission logs; includes cache invalidation and toast feedback for mutations.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-7",
      "title": "User profile registration and persistence",
      "synonyms": [
        "register",
        "getCallerUserProfile",
        "saveCallerUserProfile"
      ],
      "description": "Supports profile creation and updates including username, belt progress (belt/stripes/imageUrl), optional profile picture blob, optional gym info, optional practitioner-since timestamp, and additional structured fields stored in the backend profile type.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-8",
      "title": "Profile setup and edit UI",
      "synonyms": [
        "ProfileSetup",
        "avatar upload",
        "gym favicon detection",
        "practitioner-since selector"
      ],
      "description": "Form UI to create/edit a profile with username, belt/stripes selection and belt preview image, profile picture upload converted to ExternalBlob, gym name/location and website favicon detection, and practitioner-since month/year selection.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-9",
      "title": "App shell with conditional gating based on auth, actor readiness, and profile existence",
      "synonyms": [
        "App.tsx",
        "ProfileSetup gating",
        "Dashboard routing"
      ],
      "description": "Orchestrates a linear startup flow: Internet Identity init → actor connection → profile fetch. Routes to login, profile setup (if missing), or dashboard; supports in-place profile edit mode.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-10",
      "title": "Header with profile access, theme toggle, debug toggle, and logout",
      "synonyms": [
        "Header",
        "next-themes",
        "bjj-theme",
        "bjj-debug-mode"
      ],
      "description": "Sticky header shows app branding and a profile shortcut, toggles dark/light theme (local-first) with optional backend persistence, toggles debug mode stored in localStorage (reloads), and logs out by clearing identity and React Query cache.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-11",
      "title": "Training session persistence APIs (per-user)",
      "synonyms": [
        "getTrainingRecords",
        "addTrainingRecord",
        "saveTrainingRecords"
      ],
      "description": "Backend stores per-user training sessions and supports fetching sessions, adding a session, and overwriting all sessions (used for edits). Sessions include date, duration, gi/no-gi, theme, rolls, mood rating, intensity, and belt snapshot.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-12",
      "title": "Training session logging and editing dialog",
      "synonyms": [
        "AddTrainingDialog",
        "week-view date picker",
        "mood slider",
        "intensity selector"
      ],
      "description": "Dialog UI to create/edit sessions with week-based date selection, duration quick-select and 0.25-hour increments, gi/no-gi toggle, theme selection, rolls and intensity inputs, and a mood slider with dynamic color; stores date as local-midnight timestamp and snapshots belt progress.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-13",
      "title": "Month-view training calendar with click-to-jump details panel and drag-to-scroll",
      "synonyms": [
        "TrainingMonthCalendar",
        "click-to-scroll highlight",
        "useDragToScroll",
        "mood icons"
      ],
      "description": "Month calendar groups sessions by local date, styles day cells by training type (Gi/No-Gi/mixed), supports clicking a day to scroll the details list to the first session and highlight it, and shows each session with intensity/theme badges and mood icon; details panel supports drag-to-scroll.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-14",
      "title": "Training Log dashboard with submission log and analytics charts",
      "synonyms": [
        "TrainingLog",
        "Recharts analytics"
      ],
      "description": "Training Log page combines month calendar, submission log section, and chart-based analytics including Gi vs No-Gi ratio, theme frequency, rolls trend, intensity trend, mood vs intensity scatter, and weekly/monthly training volume with timeframe/metric toggles.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-15",
      "title": "Submission log backend model and APIs (multi-belt)",
      "synonyms": [
        "SubmissionLog",
        "getSubmissionLog",
        "saveSubmissionLog",
        "hasBeltSubmission"
      ],
      "description": "Backend stores a per-user submission log grouped by opponent belt (white/blue/purple/brown/black), returns a default empty structure when missing, and normalizes duplicates case-insensitively on save. Includes helpers to query submissions per belt.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-16",
      "title": "Submission log UI with opponent belt selector, searchable add, and save-on-change",
      "synonyms": [
        "SubmissionLogSection",
        "SubmissionSelectInput",
        "show more/less"
      ],
      "description": "Frontend maintains a local multi-belt submission log, defaults opponent belt to the user’s current belt, supports switching belt groups, adding/removing submissions via a searchable popover dropdown, shows show-more/less for long lists, and only shows Save when local state differs from backend state.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-17",
      "title": "Submission log normalization utilities",
      "synonyms": [
        "submissionLogUtils",
        "normalizeSubmissionName",
        "mergeDuplicates",
        "add/remove/increment/decrement"
      ],
      "description": "Utility functions for case-insensitive normalization, duplicate detection/merging, and CRUD-style updates of submission counts within a belt grouping.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-18",
      "title": "Belt progress persistence and belt tracker UI",
      "synonyms": [
        "getBeltProgress",
        "updateBeltProgress",
        "BeltTracker",
        "belt ladder"
      ],
      "description": "Users can fetch/update belt progress; UI displays current belt/stripes with belt images, allows updating belt/stripes, and renders a belt progression ladder with completed/current/next/locked visual states.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-19",
      "title": "Gamified belt progression stats (client-side)",
      "synonyms": [
        "calculateBeltGamifiedStats",
        "progress bars",
        "submission thresholds"
      ],
      "description": "Computes belt stats from sessions and submission log for the current belt: progression percent (stripes + hour milestones), experience curve (hours), unique-submission proficiency vs belt thresholds, and technique mastery based on theme coverage, rendered as progress bars with tooltips.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-20",
      "title": "Technique library backend APIs and per-user storage",
      "synonyms": [
        "Technique",
        "getTechniques",
        "addTechnique",
        "getAllTechniques"
      ],
      "description": "Backend stores per-user techniques (name, SessionTheme category, type string, description, link, optional thumbnail blob, tags, linked session IDs) and supports user-scoped fetch/add plus admin aggregation across all users.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-21",
      "title": "Technique library UI with search, category filtering, and add dialog",
      "synonyms": [
        "TechniqueLibrary",
        "AddTechniqueDialog",
        "category tabs"
      ],
      "description": "Technique Library page provides full-text search and SessionTheme-based category filtering and card-based technique display; add dialog supports technique details, tags, and link entry with automatic YouTube thumbnail preview generation.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-22",
      "title": "Technique type dropdown constrained height with vertical scrolling",
      "synonyms": [
        "AddTechniqueDialog type SelectContent max-height",
        "scrollable dropdown"
      ],
      "description": "The technique “Type” dropdown in the Add Technique dialog constrains option list height (max-h) and enables vertical scrolling so the list does not extend off-screen.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-23",
      "title": "Intensity display utilities for labeling, badges, and charting",
      "synonyms": [
        "intensityUtils",
        "INTENSITY_OPTIONS",
        "intensityToNumeric"
      ],
      "description": "Defines intensity options and helpers to map intensity values to labels, short codes, Tailwind badge color classes, numeric values for averaging/charting, and numeric-to-label conversions.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-24",
      "title": "Training analytics aggregation utilities",
      "synonyms": [
        "trainingAnalytics",
        "bucketing",
        "volume/roll/intensity series"
      ],
      "description": "Shared functions for duration-to-hours conversion, favorite theme, average intensity, unique submission counting (blue+), week/month time bucketing, and chart-ready aggregations for rolls, intensity, training volume, and mood-intensity correlation.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-25",
      "title": "Yearly training heat map visualization (session-derived)",
      "synonyms": [
        "TrainingHeatMap",
        "GitHub-style heatmap"
      ],
      "description": "Renders a year-long Monday→Sunday heat map of daily training hours aggregated from sessions using local date mapping, with month headers aligned to week columns and theme-aware empty-cell colors that update on theme changes.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-26",
      "title": "Manual training-hours overrides APIs and editable heat map UI",
      "synonyms": [
        "TrainingHoursHeatMap",
        "setTrainingHours",
        "clearTrainingHours",
        "getAllTrainingHours"
      ],
      "description": "Backend supports storing per-day training-hour records; frontend editable heat map merges session-derived hours with manual overrides and provides date/hour inputs with 0.25-hour increments plus Save/Clear actions.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-27",
      "title": "Theme preference persistence",
      "synonyms": [
        "updateThemePreference",
        "getThemePreference"
      ],
      "description": "Theme toggle updates UI immediately (localStorage/next-themes) and asynchronously persists the preference to the backend for authenticated users.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-28",
      "title": "Image preloading and cached image component",
      "synonyms": [
        "imageCache",
        "CachedImage",
        "preloadAllBeltImages"
      ],
      "description": "In-memory image preloading/caching plus a CachedImage component with fallback and loading opacity; belt images are preloaded to reduce flicker.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-29",
      "title": "Mood icon mapping helper and rounded-corner mood rendering",
      "synonyms": [
        "moodIcons",
        "getMoodIcon",
        "rounded-xl mood images"
      ],
      "description": "Maps mood rating values (0–1) to canonical mood icon asset paths and labels, and renders mood images with rounded corners (rounded-xl) in the month details UI.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-30",
      "title": "Backend system/admin reporting endpoints",
      "synonyms": [
        "getSystemStatus",
        "getUserProfilesCount",
        "getAllUsersTrainingHours"
      ],
      "description": "Admin-only backend endpoints provide system counts/status and aggregated training-hours reporting across users.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-31",
      "title": "Blob-storage maintenance and cycles refill endpoints (Caffeine integration)",
      "synonyms": [
        "_caffeineStorageUpdateGatewayPrincipals",
        "_caffeineStorageBlobsToDelete",
        "_caffeineStorageConfirmBlobDeletion",
        "_caffeineStorageRefillCashier"
      ],
      "description": "Backend exposes maintenance endpoints for authorized blob-gateway principals (dead-blob listing/pruning, liveness checks) and a cashier cycles refill operation guarded by a cashier principal.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-32",
      "title": "Deployment and smoke-check documentation templates (Draft versions)",
      "synonyms": [
        "REBUILD_DEPLOY_*",
        "SMOKE_CHECK_*",
        "REDEPLOY_NOTE_*"
      ],
      "description": "Markdown templates/checklists documenting clean rebuild/redeploy procedures and post-deployment smoke checks across multiple draft versions, including structured failure reporting fields.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "feature-create-a-new-caffeine-draft-and-deploy-the-exact-same-application-version-currently-deployed-version-125-with-no-changes-to-backend-or-frontend-source-code-and-no-state-schema-migrations",
      "title": "Create a new Caffeine draft and deploy the exact same application version currently deployed (Version 125) with no changes to backend or frontend source code and no state/schema migrations.",
      "reqIds": [
        "REQ-1"
      ],
      "version": 1
    },
    {
      "id": "feature-add-new-deployment-documentation-for-this-redeploy-by-creating-draft-125-versions-of-the-existing-templates-frontend-rebuild-deploy-draft-125-md-frontend-redeploy-note-draft-125-md-and-frontend-smoke-check-draft-125-md-explicitly-stating-that-there-were-no-functional-ui-schema-state-changes",
      "title": "Add new deployment documentation for this redeploy by creating Draft 125 versions of the existing templates: frontend/REBUILD_DEPLOY_DRAFT_125.md, frontend/REDEPLOY_NOTE_DRAFT_125.md, and frontend/SMOKE_CHECK_DRAFT_125.md, explicitly stating that there were no functional/UI/schema/state changes.",
      "reqIds": [
        "REQ-2"
      ],
      "version": 1
    }
  ],
  "new_feature_requests": [],
  "architectural_notes": [
    "ICP canister architecture: Motoko backend actor exposes query/shared methods; React/TypeScript frontend calls via a generated actor interface.",
    "Backend uses compositional Motoko mixins for cross-cutting concerns (authorization RBAC and blob-storage maintenance endpoints).",
    "Backend storage is in-memory Maps keyed by Principal (no stable persistence), so data is ephemeral across upgrades/redeploys.",
    "Frontend uses React + TypeScript, TailwindCSS, shadcn/ui (Radix primitives), lucide-react icons, and Recharts for data visualization.",
    "TanStack React Query centralizes backend reads/writes with typed hooks and cache invalidation after mutations.",
    "Authentication is handled with @dfinity/auth-client (Internet Identity) and identity is restored on reload when authenticated.",
    "Actor creation is wrapped in a dedicated hook that tracks initialization steps and emits diagnostics for a debug overlay.",
    "Date/time handling intentionally uses local time conversions (e.g., sessions stored at local-midnight timestamp and mapped to local YYYY-MM-DD for calendar/heatmaps).",
    "Theming is local-first via next-themes + localStorage, with optional asynchronous backend persistence (theme preference update).",
    "UX/performance includes client-side image preloading/caching (belt images and general cached image helper)."
  ],
  "known_issues": [
    "Backend RBAC has a blocking trap for new principals: AccessControl.getUserRole traps when a caller is not registered; backend ensureUserRole calls getUserRole, so registration and other mutations can trap for first-time users unless access control is initialized/roles are assigned.",
    "_initializeAccessControlWithSecret traps if CAFFEINE_ADMIN_TOKEN is not set in the canister environment, making deployments sensitive to missing env configuration.",
    "Blob-storage cashier env var name is misspelled as CAFFFEINE_STORAGE_CASHIER_PRINCIPAL (three 'F's), increasing risk of misconfiguration and runtime traps when those endpoints are used.",
    "Mood icon helper expects /assets/generated/{tough,hard,okay,good,great}.png but the repo includes only *.dim_512x512.png variants; this likely causes 404s unless additional .png assets are provided at deploy time.",
    "React Query hooks sometimes swallow backend errors and return empty defaults ([], null), which can mask authorization/config issues unless console logs are inspected.",
    "There are two different actor hooks (useActorWrapper and useActor). The legacy useActor unconditionally calls _initializeAccessControlWithSecret even with an empty token, which can fail initialization if it were used in place of the wrapper.",
    "Backend methods and frontend date conversions rely on local-midnight timestamps; DST boundary days can still cause edge-case off-by-one mapping issues in some timezones.",
    "Some files are placeholders/empty (e.g., frontend/src/components/Profile.tsx, frontend/src/hooks/useActorReady.ts, frontend/src/lib/submissionsListLoader.ts), suggesting incomplete/unused planned functionality.",
    "Frontend has both frontend/src/index.css and frontend/index.css in the repository listing, which can cause confusion about the authoritative global style source (only src/index.css is imported by main.tsx).",
    "Caffeine draft backend canister frequently becomes stopped (Reject code 5 / IC0508 \"canister is stopped\"), requiring rebuild/redeploy/new draft to restore operation; likely related to draft canister lifecycle/cycles/upgrade traps."
  ],
  "isFixRequest": true,
  "gameProjectType": "none",
  "projectName": "Jiu-Jitsu Journey",
  "clarification_mode": "instant",
  "clarification_rounds": 0
}