{
  "schemaVersion": "1.0.0",
  "projectStateVersion": 39,
  "summary": "Jiu-Jitsu Journey is an Internet Computer (ICP) dapp for Brazilian Jiu-Jitsu practitioners. Users authenticate with Internet Identity, create and edit a profile (belt/stripes, optional avatar, gym info, practitioner-since date), log and edit training sessions (date, duration, gi/no-gi, theme, intensity, rolls, mood), track belt progression with client-side gamified stats, maintain a multi-belt submission log (submissions landed vs opponent belt), build a personal technique library, and visualize activity via a month calendar, analytics charts, and GitHub-style yearly heat maps (including an editable training-hours override heat map). The backend is a Motoko canister with RBAC plus optional Caffeine blob-storage maintenance/cycles refill endpoints.",
  "existing_features": [
    {
      "id": "IF-1",
      "title": "Internet Identity authentication provider",
      "synonyms": [
        "InternetIdentityProvider",
        "useInternetIdentity",
        "AuthClient integration"
      ],
      "description": "Provides login/logout via Internet Identity using @dfinity/auth-client, restores a stored authenticated identity on mount, and exposes identity plus lifecycle status flags (initializing/logging-in/success/error) via React context.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-2",
      "title": "Backend actor initialization wrapper with step tracking and diagnostics",
      "synonyms": [
        "useActorWrapper",
        "actorReady",
        "InitStep",
        "getActorInitLogs"
      ],
      "description": "Creates an anonymous or authenticated backend actor depending on auth state, tracks a linear init sequence (auth-started → identity-retrieved → actor-creating → actor-ready), and records a global circular init log buffer for the debug overlay.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-3",
      "title": "Secret admin token extraction from URL hash with session persistence",
      "synonyms": [
        "getSecretParameter",
        "getSecretFromHash",
        "urlParams utilities"
      ],
      "description": "Extracts sensitive parameters (e.g., caffeineAdminToken) from the URL hash fragment, stores them in sessionStorage for the session, and removes them from the URL via history.replaceState to reduce leakage via history/referrers.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-4",
      "title": "In-app debug overlay for auth/actor/profile diagnostics",
      "synonyms": [
        "DebugOverlay",
        "init progress panel",
        "actor log viewer"
      ],
      "description": "Toggleable debug panel showing initialization progress, Internet Identity status, actor readiness/errors, profile query status, elapsed time, and a scrolling view of actor init logs with warning/error highlighting.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-5",
      "title": "Backend role-based access control (RBAC) with admin bootstrap",
      "synonyms": [
        "authorization/access-control",
        "MixinAuthorization",
        "getCallerUserRole",
        "assignCallerUserRole"
      ],
      "description": "Motoko authorization supports #admin/#user/#guest roles, bootstrap initialization via env-provided admin token matched against a user-provided secret, role lookup/admin check APIs, and admin-only role assignment.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-6",
      "title": "Centralized React Query hooks for backend reads/writes",
      "synonyms": [
        "useQueries",
        "TanStack Query data layer"
      ],
      "description": "Typed queries/mutations for profile, registration, training sessions, belt progress, techniques, custom technique types, theme preference, training hours, and submission log; includes cache invalidation and toast feedback for mutations.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-7",
      "title": "User profile registration and persistence",
      "synonyms": [
        "register",
        "getCallerUserProfile",
        "saveCallerUserProfile"
      ],
      "description": "Supports creating and updating the per-user profile including username, belt progress (belt/stripes/imageUrl), optional profile picture blob, optional gym info, optional practitioner-since timestamp, plus additional structured fields stored in the backend profile type (bio, nickname, goals/milestones arrays, themePreference).",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-8",
      "title": "Profile setup and edit UI",
      "synonyms": [
        "ProfileSetup",
        "avatar upload",
        "gym favicon detection",
        "practitioner-since selector"
      ],
      "description": "Form UI to create/edit a profile with username, belt/stripes selection and belt preview image, profile picture upload converted to ExternalBlob, gym name/location and favicon-based logo URL detection, and practitioner-since month/year selection.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-9",
      "title": "App shell with conditional gating based on auth, actor readiness, and profile existence",
      "synonyms": [
        "App.tsx",
        "ProfileSetup gating",
        "Dashboard routing"
      ],
      "description": "Orchestrates a linear startup flow: Internet Identity init → actor connection → profile fetch; routes to login screen, profile setup (if missing), or the main dashboard; supports in-place profile edit mode triggered from the header.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-10",
      "title": "Header with profile shortcut, theme toggle, debug toggle, and logout",
      "synonyms": [
        "Header",
        "next-themes",
        "bjj-theme",
        "bjj-debug-mode"
      ],
      "description": "Sticky header showing branding, responsive profile access button, dark/light theme toggle (local-first with optional backend persistence), debug mode toggle stored in localStorage (reloads), and logout that clears identity and React Query cache.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-11",
      "title": "Training sessions per-user storage and APIs",
      "synonyms": [
        "getTrainingRecords",
        "addTrainingRecord",
        "saveTrainingRecords"
      ],
      "description": "Backend stores per-user training sessions and supports fetching all sessions, appending a new session, and overwriting all sessions (used for edits). Sessions include date (Time), duration, gi/no-gi, theme, rolls, mood rating, intensity, and a belt snapshot.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-12",
      "title": "Training session logging and editing dialog",
      "synonyms": [
        "AddTrainingDialog",
        "week-view date picker",
        "mood slider",
        "intensity selector"
      ],
      "description": "Dialog UI to create/edit sessions with week-based date selection, duration quick-select and 0.25-hour increments, gi/no-gi toggle, theme selection, rolls and intensity inputs, and a mood slider with dynamic color; stores date as local-midnight timestamp and snapshots the current belt progress into the session.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-13",
      "title": "Month-view training calendar with click-to-jump details panel and drag-to-scroll",
      "synonyms": [
        "TrainingMonthCalendar",
        "click-to-scroll highlight",
        "useDragToScroll",
        "mood icons"
      ],
      "description": "Month calendar groups sessions by local date, styles day cells by training type (Gi/No-Gi/mixed), supports clicking a day to scroll the details list to the first session and highlight it, and shows each session with intensity/theme badges and mood icon; details panel supports drag-to-scroll.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-14",
      "title": "Training Log dashboard with analytics charts and submission log section",
      "synonyms": [
        "TrainingLog",
        "Recharts analytics"
      ],
      "description": "Training Log page combines month calendar, submission log section, and chart-based analytics including Gi vs No-Gi ratio, theme frequency, rolls trend, intensity trend, mood vs intensity scatter, and weekly/monthly training volume with timeframe/metric toggles.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-15",
      "title": "Submission log backend model and APIs (multi-belt)",
      "synonyms": [
        "SubmissionLog",
        "getSubmissionLog",
        "saveSubmissionLog",
        "hasBeltSubmission"
      ],
      "description": "Backend stores a per-user submission log grouped by opponent belt (white/blue/purple/brown/black), returns an empty default log when missing, provides duplicate-safe save behavior, and supports checking whether a belt group contains a submission.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-16",
      "title": "Submission log UI with opponent belt selector, searchable add, and save-on-change",
      "synonyms": [
        "SubmissionLogSection",
        "SubmissionSelectInput",
        "show more/less"
      ],
      "description": "Frontend maintains a local multi-belt submission log synced from backend, defaults opponent belt to the user’s current belt, supports switching belt groups, adding/removing submissions via a searchable popover dropdown, collapses long lists with show-more/less, detects unsaved changes, and only shows Save when local state differs from backend state.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-17",
      "title": "Submission log normalization utilities",
      "synonyms": [
        "submissionLogUtils",
        "normalizeSubmissionName",
        "mergeDuplicates",
        "add/remove/increment/decrement"
      ],
      "description": "Utility functions for case-insensitive normalization, duplicate detection/merging, and CRUD-style updates of submission counts within a belt grouping.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-18",
      "title": "Belt progress persistence and belt tracker UI",
      "synonyms": [
        "getBeltProgress",
        "updateBeltProgress",
        "BeltTracker",
        "belt ladder"
      ],
      "description": "Users can fetch/update belt progress; UI displays current belt/stripes with belt images, allows updating belt/stripes, and renders a belt progression ladder with completed/current/next/locked visual states.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-19",
      "title": "Gamified belt progression stats (client-side)",
      "synonyms": [
        "calculateBeltGamifiedStats",
        "progress bars",
        "submission thresholds"
      ],
      "description": "Computes gamified belt stats from sessions and submission log for the current belt: progression percent (stripes + hour milestones), experience curve (hours), unique-submission proficiency vs belt thresholds, and technique mastery based on theme coverage; rendered as progress bars with tooltips.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-20",
      "title": "Technique library backend APIs and per-user storage",
      "synonyms": [
        "Technique",
        "getTechniques",
        "addTechnique",
        "getAllTechniques"
      ],
      "description": "Backend stores per-user techniques (name, SessionTheme category, type string, description, link, optional thumbnail blob, tags, linked session IDs) and supports user-scoped fetch/add plus admin aggregation across all users.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-21",
      "title": "Technique library UI with search, category filtering, and add dialog",
      "synonyms": [
        "TechniqueLibrary",
        "AddTechniqueDialog",
        "category tabs"
      ],
      "description": "Technique Library page provides full-text search and SessionTheme-based category filtering and card-based technique display; add dialog supports technique details, tags, and link entry with automatic YouTube thumbnail preview generation.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-22",
      "title": "Intensity display utilities for labeling, badges, and charting",
      "synonyms": [
        "intensityUtils",
        "INTENSITY_OPTIONS",
        "intensityToNumeric"
      ],
      "description": "Defines intensity options and helpers to map intensity values to labels, short codes, Tailwind badge color classes, and numeric values for averaging/charting plus numeric-to-label conversions.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-23",
      "title": "Training analytics aggregation utilities",
      "synonyms": [
        "trainingAnalytics",
        "bucketing",
        "volume/roll/intensity series"
      ],
      "description": "Shared functions for duration-to-hours conversion, favorite theme, average intensity, unique submission counting (blue+), week/month time bucketing, and chart-ready aggregations for rolls, intensity, training volume, and mood-intensity correlation.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-24",
      "title": "Yearly training heat map visualization (session-derived)",
      "synonyms": [
        "TrainingHeatMap",
        "GitHub-style heatmap"
      ],
      "description": "Renders a year-long Monday→Sunday heat map of daily training hours aggregated from sessions using local date mapping, with month headers aligned to week columns and theme-aware empty-cell colors that update on theme changes.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-25",
      "title": "Manual training-hours overrides APIs and editable heat map UI",
      "synonyms": [
        "TrainingHoursHeatMap",
        "setTrainingHours",
        "clearTrainingHours",
        "getAllTrainingHours"
      ],
      "description": "Backend supports storing per-day training-hour records; frontend editable heat map merges session-derived hours with manual overrides and provides date/hour inputs with 0.25-hour increments plus Save/Clear actions.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-26",
      "title": "Theme preference persistence",
      "synonyms": [
        "updateThemePreference",
        "getThemePreference"
      ],
      "description": "Theme toggle updates UI immediately via next-themes/localStorage and asynchronously persists the preference to the backend for authenticated users.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-27",
      "title": "Image preloading and cached image rendering",
      "synonyms": [
        "imageCache",
        "CachedImage",
        "preloadAllBeltImages"
      ],
      "description": "In-memory image preloading/caching plus a CachedImage component with fallback and loading opacity; belt images are preloaded to reduce flicker when navigating between views.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-28",
      "title": "Mood icon mapping helper",
      "synonyms": [
        "moodIcons",
        "getMoodIcon",
        "getMoodLabel"
      ],
      "description": "Maps mood rating values (0–1) to canonical mood icon asset paths and labels with safe fallbacks for invalid ratings; used to render mood indicators in the calendar details view.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-29",
      "title": "Drag-to-scroll interaction helper",
      "synonyms": [
        "useDragToScroll",
        "grab-to-scroll"
      ],
      "description": "Reusable hook that enables pointer-based drag-to-scroll for scroll containers, improving UX for long lists/panels on desktop and touch devices.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-30",
      "title": "Admin/system reporting endpoints",
      "synonyms": [
        "getSystemStatus",
        "getUserProfilesCount",
        "getAllUsersTrainingHours",
        "getTrainingHoursForAllUsers"
      ],
      "description": "Admin-only backend endpoints provide system counts/status and aggregated training-hours reporting across users.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-31",
      "title": "Caffeine blob-storage maintenance and cycles refill endpoints",
      "synonyms": [
        "_caffeineStorageUpdateGatewayPrincipals",
        "_caffeineStorageBlobsToDelete",
        "_caffeineStorageConfirmBlobDeletion",
        "_caffeineStorageRefillCashier"
      ],
      "description": "Backend exposes blob-storage maintenance endpoints for authorized gateway principals (dead-blob listing/pruning, blob liveness) and a cashier cycles refill operation guarded by a cashier principal.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-32",
      "title": "Deployment documentation and smoke-check templates (Draft versions)",
      "synonyms": [
        "REBUILD_DEPLOY_*",
        "SMOKE_CHECK_*",
        "REDEPLOY_NOTE_*"
      ],
      "description": "Markdown templates/checklists documenting clean rebuild/redeploy procedures and post-deployment smoke checks across multiple draft versions, including structured failure reporting fields.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-33",
      "title": "Profile view component (read-only summary + entry point to edit)",
      "synonyms": [
        "Profile.tsx",
        "ProfileAnalytics"
      ],
      "description": "Implements the previously-empty Profile component to render the user profile information and related profile-level analytics/summary UI, complementing ProfileSetup (edit) and header-driven edit mode.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-34",
      "title": "Analytics page/component implementation",
      "synonyms": [
        "Analytics.tsx"
      ],
      "description": "Implements the previously-empty Analytics component/page to display analytics content (integrating existing training analytics utilities and charts).",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-35",
      "title": "Submission tag input component",
      "synonyms": [
        "SubmissionTagInput.tsx"
      ],
      "description": "Implements the previously-empty SubmissionTagInput component for tag-style entry/selection of submissions used by the submission logging UI.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-36",
      "title": "Actor readiness hook",
      "synonyms": [
        "useActorReady.ts"
      ],
      "description": "Implements the previously-empty useActorReady hook to provide a focused readiness/status signal for backend actor initialization (usable by components needing a simple ready gate).",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-37",
      "title": "Submission options/list loader utility",
      "synonyms": [
        "submissionsListLoader.ts",
        "submissionOptions"
      ],
      "description": "Implements the previously-empty submissions list loader utility to provide/prepare the selectable submission options used by submission-related inputs.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-38",
      "title": "Reusable build template for ICP + React + shadcn/ui",
      "synonyms": [
        "build-template",
        "build.sh",
        "icp.yaml template",
        "template deploy.sh"
      ],
      "description": "Adds a self-contained build-template scaffold (backend/frontend canister yamls, React+Vite+Tailwind+shadcn/ui setup, lint rules, image resize/prune scripts, and deployment scripts) to standardize builds and deployments for the project.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-39",
      "title": "Profile Analytics small-screen responsiveness with horizontally scrollable heat map",
      "synonyms": [
        "AR-2",
        "ProfileAnalytics responsive layout",
        "scrollable heatmap grid"
      ],
      "description": "Updates the Profile Analytics layout for small screens so the Profile Area and Training Statistics metrics remain within the viewport while preserving heat map aspect ratio/cell sizing by making only the heat-map grid+labels horizontally scrollable on narrow viewports.",
      "reqIds": [
        "AR-2"
      ],
      "version": 1
    },
    {
      "id": "feature-implement-an-animated-google-lens-style-multicolor-gradient-glow-highlight-blue-green-yellow-red-tones-that-works-in-both-light-and-dark-themes-and-expose-it-as-reusable-styling-tailwind-utilities-and-or-css-utility-classes-so-it-can-be-applied-consistently-to-the-specified-ui-elements-only",
      "title": "Implement an animated, Google Lens-style multicolor gradient glow highlight (blue → green → yellow → red tones) that works in both light and dark themes, and expose it as reusable styling (Tailwind utilities and/or CSS utility classes) so it can be applied consistently to the specified UI elements only.",
      "reqIds": [
        "REQ-1"
      ],
      "version": 1
    },
    {
      "id": "feature-update-the-header-branding-area-to-use-the-animated-google-lens-style-gradient-glow-styling-only-for-a-the-jiu-jitsu-journey-name-text-and-b-the-profile-button-desktop-profile-button-in-the-header-do-not-apply-the-new-glow-styling-to-other-header-controls-theme-toggle-logout-etc",
      "title": "Update the header branding area to use the animated Google Lens-style gradient glow styling ONLY for: (a) the “Jiu-Jitsu Journey” name text, and (b) the Profile button (desktop profile button in the header). Do not apply the new glow styling to other header controls (theme toggle, logout, etc.).",
      "reqIds": [
        "REQ-2"
      ],
      "version": 1
    },
    {
      "id": "feature-update-the-dashboard-tab-navigation-so-that-only-the-selected-tab-buttons-profile-analytics-training-log-belt-tracker-techniques-use-the-animated-google-lens-style-multicolor-gradient-as-the-entire-button-background-in-both-light-and-dark-themes-non-selected-tabs-must-keep-their-current-styling-no-multicolor-gradient-background",
      "title": "Update the dashboard tab navigation so that ONLY the selected tab buttons (Profile Analytics, Training Log, Belt Tracker, Techniques) use the animated Google Lens-style multicolor gradient as the entire button background, in both light and dark themes. Non-selected tabs must keep their current styling (no multicolor gradient background).",
      "reqIds": [
        "REQ-3"
      ],
      "version": 1
    },
    {
      "id": "feature-update-the-welcome-login-page-to-apply-the-animated-google-lens-style-multicolor-gradient-glow-styling-only-to-a-the-bjj-icon-at-the-top-of-the-page-b-the-login-with-internet-identity-button-and-c-the-four-rounded-areas-on-the-welcome-page-the-rounded-info-panel-inside-the-welcome-card-and-the-three-rounded-feature-tiles-ensure-the-page-remains-readable-and-accessible-in-both-light-and-dark-themes",
      "title": "Update the welcome/login page to apply the animated Google Lens-style multicolor gradient glow styling ONLY to: (a) the BJJ icon at the top of the page, (b) the “Login with Internet Identity” button, and (c) the four rounded areas on the welcome page (the rounded info panel inside the Welcome card and the three rounded feature tiles). Ensure the page remains readable and accessible in both light and dark themes.",
      "reqIds": [
        "REQ-4"
      ],
      "version": 1
    }
  ],
  "new_feature_requests": [
    {
      "id": "AR-1",
      "summary": "Add modern sleek multi-colored “Google Lens-style” gradient glow highlights to specific UI elements (header title/profile button, selected tabs, and welcome page icon/sign-in button/4 rounded areas)",
      "reqIds": [],
      "status": "pending"
    }
  ],
  "architectural_notes": [
    "ICP canister architecture: Motoko backend actor exposes query/shared methods; TypeScript frontend calls via generated actor/bindings.",
    "Authorization uses a Motoko RBAC module (AccessControl) and a mixin (MixinAuthorization) to compose auth endpoints into the main actor.",
    "Backend composes additional operational endpoints via a blob-storage mixin (MixinStorage) that relies on platform primitives (dead-blob listing/pruning, liveness checks, cycles top-up).",
    "Frontend is React + TypeScript with TanStack React Query for data fetching/mutations and cache invalidation; UI built with TailwindCSS + shadcn/ui (Radix primitives), lucide-react icons, and Recharts charts.",
    "Actor creation is encapsulated in a dedicated hook (useActorWrapper) that tracks initialization steps and writes a small global init log buffer for diagnostics.",
    "Date handling is intentionally local-time based (sessions stored at local midnight; heatmaps/calendars map timestamps to local YYYY-MM-DD).",
    "Theming is local-first (next-themes + localStorage) with an optional asynchronous backend persistence call for authenticated users.",
    "UX/perf helpers include drag-to-scroll for long panels and in-memory image preloading/caching to reduce flicker.",
    "A reusable build-template scaffold was added (ICP canister yamls + React/Vite/Tailwind/shadcn/ui + scripts) to standardize local builds and deployments.",
    "Profile Analytics UI should be responsive on small screens; training heat map keeps its ratio but becomes horizontally scrollable on narrow viewports."
  ],
  "known_issues": [
    "_initializeAccessControlWithSecret traps if CAFFEINE_ADMIN_TOKEN is not set in the canister environment; deployments are sensitive to missing env configuration.",
    "Blob-storage cashier env var name is spelled CAFFFEINE_STORAGE_CASHIER_PRINCIPAL (three 'F's), increasing risk of misconfiguration and runtime traps.",
    "Backend state uses in-memory vars/Maps (no stable persistence shown), so user data may be lost across upgrades/redeploys unless stable storage is implemented elsewhere.",
    "Mood icon helper expects /assets/generated/{tough,hard,okay,good,great}.png, but repo assets shown are *.dim_512x512.png; may cause 404s unless non-dim .png variants are also deployed.",
    "Some React Query hooks swallow errors and return empty defaults ([], null), which can mask authorization/config issues unless console logs are inspected.",
    "There are two global Tailwind/CSS files (frontend/index.css and frontend/src/index.css); only src/index.css is imported, but duplication can cause confusion about the authoritative style source.",
    "Local-midnight timestamp strategy can still produce edge-case date bucketing issues around DST transitions in some timezones.",
    "Some content IDs load (e.g., 150xlr4, 19sngkx) while others (e.g., lf4nkz) fail and/or their images do not render; investigate ID-based routing/asset retrieval and image loading logic."
  ],
  "isFixRequest": false,
  "gameProjectType": "none",
  "projectName": "Jiu-Jitsu Journey",
  "clarification_mode": "thinking",
  "clarification_rounds": 0
}